[
  {
    "slug": "javascript-a-beginners-guide-fourth-edition-inkling-ch",
    "thumbnail": "http://books.google.com/books/content?id=NVjKLIj0808C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "JavaScript: A Beginner's Guide, Fourth Edition (INKLING CH)",
    "description": "Fully updated for the latest JavaScript standard and featuring a new chapter on HTML5 and jQuery JavaScript: A Beginner's Guide shows how to create dynamic Web pages complete with special effects using today's leading Web development language. With the growth of HTML 5, JavaScript is expected to grow even more to script the canvas element, add drag and drop functionality, and more. This fast-paced tutorial provides step-by-step coverage of the fundamentals, including variables, functions, operators, event handlers, objects, arrays, strings, and forms. The book then moves to more advanced techniques, including debugging, accessibility, and security. This pedagogically rich, hands-on guide explains how JavaScript works with HTML 5 and covers the new features available in JavaScript. Key Skills & Concepts--Chapter-opening lists of specific skills covered in the chapter Ask the Expert--Q & A sections filled with bonus information and helpful tips Try This--Hands-on exercises that show you how to apply your skills Notes--Extra information related to the topic being covered Tips--Helpful reminders or alternate ways of doing things Self-Tests--End-of-chapter reviews to test your knowledge Annotated syntax--Example code with commentary that describes the programming techniques being illustrated Code downloads provided for projects in the book",
    "authors": [
      {
        "slug": "john-pollock",
        "name": "John Pollock"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "javascript-in-easy-steps",
    "thumbnail": "http://books.google.com/books/content?id=qOF6AAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Javascript in Easy Steps",
    "description": "",
    "authors": [
      {
        "slug": "mike-mcgrath",
        "name": "Mike McGrath"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "javascript-demystified",
    "thumbnail": "http://books.google.com/books/content?id=0bmK3Ey9LLUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "JavaScript Demystified",
    "description": "Even if you have no programming experience, you'll learn to create dynamic, interactive Web pages with help from this easy-to-use, self-teaching guide. Author and programming instructor Jim Keogh covers the basics of this leading Web development language and explains how to write cross-browser JavaScript programs in no time.",
    "authors": [
      {
        "slug": "jim-keogh",
        "name": "Jim Keogh"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "notice-of-intention-to-adopt-amend-or-repeal-rules",
    "thumbnail": "http://books.google.com/books/content?id=NVjKLIj0808C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Notice of Intention to Adopt, Amend Or Repeal Rules",
    "description": "Notice of a public meeting to be held on Jan. 15, 1971 by the Factory-Built Housing Section, Dept. of Labor & Industries, with copies of pertinent rules and legislation.",
    "authors": [
      {
        "slug": "washington-state-department-of-labor-and-industries",
        "name": "Washington (State). Department of Labor and Industries"
      },
      {
        "slug": "washington-state-department-of-labor-and-industries-factory-built-housing-and-commercial-structures-section",
        "name": "Washington (State). Department of Labor and Industries. Factory-Built Housing and Commercial Structures Section"
      },
      {
        "slug": "washington-state-legislature-committee-on-labor-and-social-security",
        "name": "Washington (State). Legislature. Committee on Labor and Social Security"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "javascript-for-dummies",
    "thumbnail": "http://books.google.com/books/content?id=pHU4xVJDXIIC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "JavaScript For Dummies",
    "description": "Responding to reader feedback, the author has thoroughly revamped the book with more step-by-step coverage of JavaScript basics, an exclusive focus on Internet Explorer, and many complete sample scripts Updated to cover JavaScript 1.5, the latest release of this popular Web scripting language Using lots of examples, including a sample working Web site, the book shows how to create dynamic and interactive pages, build entire sites, and automate pages",
    "authors": [
      {
        "slug": "emily-a-vander-veer",
        "name": "Emily A. Vander Veer"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "learn-javascript-visually",
    "thumbnail": "http://books.google.com/books/content?id=flvirQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Learn JavaScript Visually",
    "description": "Beautifully Illustrated book that teaches javascript fundamentals trough metaphors, analogies and easy step-by-step exercises. Visual learners retain information very differently than their left brained counter-parts, and thus benefit from different approaches. Full color illustrations help memory triggers as your brain never forgets an image, metaphor or schema. One page of a visual guide can equal one chapter of a conventional book as illustrations can make a world of difference over strictly words on a page!",
    "authors": [
      {
        "slug": "ivelin-demirov",
        "name": "Ivelin Demirov"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "get-going-with-javascript",
    "thumbnail": "http://books.google.com/books/content?id=NVjKLIj0808C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Get Going with Javascript",
    "description": "",
    "authors": [
      {
        "slug": "martin-baier",
        "name": "Martin Baier"
      },
      {
        "slug": "e-ways-pty-limited",
        "name": "e-Ways Pty, Limited"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "the-abcs-of-javascript",
    "thumbnail": "http://books.google.com/books/content?id=zeNlQgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "The ABCs of JavaScript",
    "description": "JavaScript is an Internet publishing language which allows all levels of user to create and insert Java applets into their home pages. This book teaches JavaScript using an informal approach and a three-part discussion of the language: an overview shows the reader what can be done; a look at the language itself shows the reader how things are done; and a presentation of real-world examples lets the reader see how to develop their own applets.",
    "authors": [
      {
        "slug": "lee-purcell",
        "name": "Lee Purcell"
      },
      {
        "slug": "mary-jane-mara",
        "name": "Mary Jane Mara"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "full-stack-javascript-development",
    "thumbnail": "http://books.google.com/books/content?id=p3UvjwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Full-Stack JavaScript Development",
    "description": "Build Full-Stack applications with simple to use, yet powerful JavaScript technologies and host everything in the cloud in an economic and agile way. This book contains an all-encompassing presentation of theory, reference and implementation for building three tier architectures - Data Layer (MongoDB), Service Layer (Express/Node.js) and Presentation Layer (Angular). Learn how to architect, develop, test, secure, deploy and manage a RESTful Web Service. In-depth coverage of NPM modules like express, async, joi, helmet, jwt-simple, supertest, mongodb and more. Utilize Mocha, Fiddler and Selenium.",
    "authors": [
      {
        "slug": "eric-bush",
        "name": "Eric Bush"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "building-mobile-apps-with-html-css-and-javascript",
    "thumbnail": "http://books.google.com/books/content?id=xC29NAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Building Mobile Apps with HTML, CSS, and JavaScript",
    "description": "Do you want to develop mobile apps with HTML, CSS, and JavaScript—and have them work on a variety of devices powered by iOS and Android? You’ve come to the right place. Ideal for web designers and developers familiar with either these popular web tools or other frontend technologies, this book teaches you the principles of mobile interface design and shows you process for building and optimizing mobile applications. You’ll also learn how to build hybrid apps—web apps that have access to native device APIs—with PhoneGap. Pick up this book and join the mobile revolution.",
    "authors": [
      {
        "slug": "jonathan-stark",
        "name": "Jonathan Stark"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "learning-threejs-the-javascript-3d-library-for-webgl",
    "thumbnail": "http://books.google.com/books/content?id=6TVeAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Learning Three.js: The JavaScript 3D Library for WebGL",
    "description": "“Learning Three.js is a hands-on guide which provides everything you need to start working with the powerful JavaScript library, and start creating awesome in-browser visualizations”.Learning Three.js is written for anyone looking to get started with Three.js, or looking to improve their skills with the popular js library. The book assumes some knowledge of javascript, but you don’t need any knowledge of Three.js itself to follow the book.",
    "authors": [
      {
        "slug": "jos-dirksen",
        "name": "Jos Dirksen"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "learn-advanced-javascript-programming",
    "thumbnail": "http://books.google.com/books/content?id=EIIGAAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Learn Advanced JavaScript Programming",
    "description": ", and CGI programmer who wants a more in-depth, advanced coverage of the JavaScript programming language. JavaScript is the adaptation of Java from Netscape with added client features making Web content easier to program.",
    "authors": [
      {
        "slug": "yehuda-shiran",
        "name": "Yehuda Shiran"
      },
      {
        "slug": "tomer-shiran",
        "name": "Tomer Shiran"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "web-technologies-html-javascript-php-java-jsp-aspnet-xml-and-ajax-black-book-with-cd",
    "thumbnail": "http://books.google.com/books/content?id=yC3BbwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Web Technologies: Html, Javascript, Php, Java, Jsp, Asp.Net, Xml And Ajax, Black Book (With Cd)",
    "description": "",
    "authors": [
      {
        "slug": "kogent-learning-solutions-inc-with-cd",
        "name": "Kogent Learning Solutions Inc. (with Cd)"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "javascript-the-good-parts",
    "thumbnail": "http://books.google.com/books/content?id=PXa2bby0oQ0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "JavaScript: The Good Parts",
    "description": "Most programming languages contain good and bad parts, but JavaScript has more than its share of the bad, having been developed and released in a hurry before it could be refined. This authoritative book scrapes away these bad features to reveal a subset of JavaScript that's more reliable, readable, and maintainable than the language as a whole—a subset you can use to create truly extensible and efficient code. Considered the JavaScript expert by many people in the development community, author Douglas Crockford identifies the abundance of good ideas that make JavaScript an outstanding object-oriented programming language-ideas such as functions, loose typing, dynamic objects, and an expressive object literal notation. Unfortunately, these good ideas are mixed in with bad and downright awful ideas, like a programming model based on global variables. When Java applets failed, JavaScript became the language of the Web by default, making its popularity almost completely independent of its qualities as a programming language. In JavaScript: The Good Parts, Crockford finally digs through the steaming pile of good intentions and blunders to give you a detailed look at all the genuinely elegant parts of JavaScript, including: Syntax Objects Functions Inheritance Arrays Regular expressions Methods Style Beautiful features The real beauty? As you move ahead with the subset of JavaScript that this book presents, you'll also sidestep the need to unlearn all the bad parts. Of course, if you want to find out more about the bad parts and how to use them badly, simply consult any other JavaScript book. With JavaScript: The Good Parts, you'll discover a beautiful, elegant, lightweight and highly expressive language that lets you create effective code, whether you're managing object libraries or just trying to get Ajax to run fast. If you develop sites or applications for the Web, this book is an absolute must.",
    "authors": [
      {
        "slug": "douglas-crockford",
        "name": "Douglas Crockford"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "web-enabled-commercial-application-development-using-html-dhtml-javascript-perl-cgi-3rd-edn",
    "thumbnail": "http://books.google.com/books/content?id=NVjKLIj0808C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Web Enabled Commercial Application Development Using Html, Dhtml, Javascript, Perl Cgi - 3Rd Edn.",
    "description": "",
    "authors": [
      {
        "slug": "ivan-bayross",
        "name": "Ivan Bayross"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "javascript-by-example",
    "thumbnail": "http://books.google.com/books/content?id=zyMUnspbsekC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "JavaScript by Example",
    "description": "The World’s Easiest Java Script Tutorial—Fully Updated! JavaScript by Example, Second Edition, is the easiest, most hands-on way to learn JavaScript. Legendary programming instructor Ellie Quigley has thoroughly updated her classic book to deliver the skills and information today’s JavaScript users need most—including up-to-the-minute coverage of JavaScript programming constructs, CSS, Ajax, JSON, and the latest JavaScript libraries and best practices. Quigley illuminates every technique with focused, classroom-tested code examples, detailed line-by-line explanations, and real program output. This exceptionally clear, easy-to-understand book takes you from your first script to advanced techniques. It’s the only JavaScript book you’ll ever need! New in This Edition End-of-chapter study tools, including classroom-tested labs Programming the DOM More Cascading Style Sheets Introduction to Ajax and JSON Explanation of how to develop interactive Web applications with dynamic, desktop-style interfaces Programmers’ preparation for HTML 5’s breakthrough capabilities This edition has been completely updated and includes many new and completely rewritten code examples; contains fully revised and updated coverage of Cascading Style Sheets (CSS) and the Document Object Model (DOM); and fully covers modern JavaScript concepts, principles, and programming techniques. Thousands of Web developers, administrators, and power users have relied on JavaScript by Example to become expert JavaScript programmers. With this new edition, you can, too—even if you’re completely new to JavaScript. After you’ve become an expert, you’ll turn to this book constantly as the best source for trustworthy answers, solutions, and code.",
    "authors": [
      {
        "slug": "ellie-quigley",
        "name": "Ellie Quigley"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "javascript",
    "thumbnail": "http://books.google.com/books/content?id=4RChxt67lvwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "JavaScript",
    "description": "A revised and updated edition offers comprehensive coverage of ECMAScript 5 (the new JavaScript language standard) and also the new APIs introduced in HTML5, with chapters on functions and classes completely rewritten and updated to match current best practices and a new chapter on language extensions and subsets. Original.",
    "authors": [
      {
        "slug": "david-flanagan",
        "name": "David Flanagan"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "javascript-for-programmers",
    "thumbnail": "http://books.google.com/books/content?id=HdOW3luqHZwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "JavaScript for Programmers",
    "description": "The practicing programmer’s Deitel® guide to XHTML®, CSS®, JavaScript™, XML® and Ajax RIA development. This book applies the Deitel signature live-code approach to teaching the client side of Rich Internet Applications (RIA) development. The book presents concepts in the context of 100+ fully tested programs (6,000+ lines of code), complete with syntax shading, detailed descriptions and sample outputs. The book features over 150 tips that will help you build robust client-side web applications. Start with an introduction to Extensible HyperText Markup Language (XHTML®) and Cascading Style Sheets (CSS®), then rapidly move on to the details of JavaScript™ programming. Finish with more advanced client-side development technologies including XHTML’s Document Object Model (DOM®), Extensible Markup Language (XML®), XML’s DOM, JavaScript Object Notation (JSON) and Asynchronous JavaScript and XML (Ajax). When you’re finished, you’ll have everything you need to build the client side of Web 2.0 Rich Internet Applications (RIAs). The book culminates with several substantial Ajax-enabled RIAs, including a book cover viewer (JavaScript/DOM), an address book (Ajax/consuming web services) and a calendar application (Ajax/Dojo/consuming web services). TheDeitel® Developer Seriesis designed for professional programmers. The series presents focused treatments of emerging technologies, including .NET, Java™, web services, Internet and web development and more.",
    "authors": [
      {
        "slug": "paul-deitel",
        "name": "Paul Deitel"
      },
      {
        "slug": "harvey-m-deitel",
        "name": "Harvey M. Deitel"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "learning-php-mysql-javascript-css-html5",
    "thumbnail": "http://books.google.com/books/content?id=J6qcAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Learning PHP, MySQL, JavaScript, CSS & HTML5",
    "description": "Build interactive, data-driven websites with the potent combination of open-source technologies and web standards, even if you only have basic HTML knowledge. With this popular hands-on guide, you’ll tackle dynamic web programming with the help of today’s core technologies: PHP, MySQL, JavaScript, CSS, and HTML5. Explore each technology separately, learn how to use them together, and pick up valuable web programming practices along the way. At the end of the book, you’ll put everything together to build a fully functional social networking site. Learn PHP in-depth, along with the basics of object-oriented programming Explore MySQL, from database structure to complex queries Create dynamic PHP web pages that tailor themselves to the user Manage cookies and sessions, and maintain a high level of security Master the JavaScript language and use it to create interactive web pages Use Ajax calls for background browser/server communication Acquire CSS2 & CSS3 skills for professionally styling your web pages Implement all the new HTML5 features, including geolocation, audio, video, and the canvas",
    "authors": [
      {
        "slug": "robin-nixon",
        "name": "Robin Nixon"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "javascript-essentials",
    "thumbnail": "http://books.google.com/books/content?id=7iMefp2PwO8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "JavaScript Essentials",
    "description": "The purpose of this ebook is to teach the essentials of the JavaScript scripting language so that anyone with a web site can learn to use this powerful language quickly and effectively. It builds detailed and in depth knowledge of all aspects of JavaScript from language basics through to advanced topics in 23 detailed chapters.This book is designed to provide a detailed and comprehensive, yet easy to follow, guide to developing powerful, dynamic web pages using JavaScript. Each subject area is accompanied by clear and concise examples putting theory into practice.It could be said that the object of JavaScript Essentials is to provide you with everything you need to use JavaScript, and nothing that you don't.",
    "authors": [
      {
        "slug": "neil-smyth",
        "name": "Neil Smyth"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "javascript-jquery-the-missing-manual",
    "thumbnail": "http://books.google.com/books/content?id=0oWMBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "JavaScript & JQuery: The Missing Manual",
    "description": "JavaScript lets you supercharge your HTML with animation, interactivity, and visual effects—but many web designers find the language hard to learn. This easy-to-read guide not only covers JavaScript basics, but also shows you how to save time and effort with the jQuery and jQuery UI libraries of prewritten JavaScript code. You’ll build web pages that feel and act like desktop programs—with little or no programming. The important stuff you need to know: Pull back the curtain on JavaScript. Learn how to build a basic program with this language. Get up to speed on jQuery. Quickly assemble JavaScript programs that work well on multiple web browsers. Transform your user interface. Learn jQuery UI, the JavaScript library for interface features like design themes and controls. Make your pages interactive. Create JavaScript events that react to visitor actions. Use animations and effects. Build drop-down navigation menus, pop-ups, automated slideshows, and more. Collect data with web forms. Create easy-to-use forms that ensure more accurate visitor responses. Practice with living examples. Get step-by-step tutorials for web projects you can build yourself.",
    "authors": [
      {
        "slug": "david-sawyer-mcfarland",
        "name": "David Sawyer McFarland"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "high-performance-javascript",
    "thumbnail": "http://books.google.com/books/content?id=ED6ph4WEIoQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "High Performance JavaScript",
    "description": "If you're like most developers, you rely heavily on JavaScript to build interactive and quick-responding web applications. The problem is that all of those lines of JavaScript code can slow down your apps. This book reveals techniques and strategies to help you eliminate performance bottlenecks during development. You'll learn how to improve execution time, downloading, interaction with the DOM, page life cycle, and more. Yahoo! frontend engineer Nicholas C. Zakas and five other JavaScript experts—Ross Harmes, Julien Lecomte, Steven Levithan, Stoyan Stefanov, and Matt Sweeney—demonstrate optimal ways to load code onto a page, and offer programming tips to help your JavaScript run as efficiently and quickly as possible. You'll learn the best practices to build and deploy your files to a production environment, and tools that can help you find problems once your site goes live. Identify problem code and use faster alternatives to accomplish the same task Improve scripts by learning how JavaScript stores and accesses data Implement JavaScript code so that it doesn't slow down interaction with the DOM Use optimization techniques to improve runtime performance Learn ways to ensure the UI is responsive at all times Achieve faster client-server communication Use a build system to minify files, and HTTP compression to deliver them to the browser",
    "authors": [
      {
        "slug": "nicholas-c-zakas",
        "name": "Nicholas C. Zakas"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "the-past-present-and-future-of-javascript",
    "thumbnail": "http://books.google.com/books/content?id=ZzQ7XTE09K8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "The Past, Present, and Future of JavaScript",
    "description": "What’s next for JavaScript? Its phenomenal rise from a simple client-side scripting tool to a versatile and flexible programming language exceeded everyone’s expectations. Now, hopes and expectations for JavaScript’s future are considerable. In this insightful report, Dr. Axel Rauschmayer explains how the combination of several technologies and opportunities in the past 15 years turned JavaScript’s fortunes. With that as a backdrop, he provides a detailed look at proposed new features and fixes in the next version, ECMAScript.next, and then presents his own JavaScript wish list—such as an integrated IDE. Understand the key role that XMLHttpRequest, JSON, jQuery, V8, Node.js, and other advances played Examine proposed fixes for ECMAScript.next through code examples Discover how JavaScript is becoming a better target for compilers Explore the technologies that will help JavaScript provide support for concurrency Learn how HTML5 is a compelling platform for JavaScript in web, mobile, and desktop applications Dr. Rauschmayer is a consultant and trainer for JavaScript, web technologies, and information management.",
    "authors": [
      {
        "slug": "axel-rauschmayer",
        "name": "Axel Rauschmayer"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "javascript-enlightenment",
    "thumbnail": "http://books.google.com/books/content?id=QedCPXDfzjAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "JavaScript Enlightenment",
    "description": "\"From library user to JavaScript developer\"--Cover.",
    "authors": [
      {
        "slug": "cody-lindley",
        "name": "Cody Lindley"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "javascript-and-html5-now",
    "thumbnail": "http://books.google.com/books/content?id=UKaDF-3H_rIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "JavaScript and HTML5 Now",
    "description": "A decade ago, Ajax took the Web out of childhood, and now HTML5 and JavaScript are moving the Web into full adulthood. This insightful overview provides striking examples of how these technologies have teamed up to give the Web a truly open platform. Author Kyle Simpson (HTML5 Cookbook) shows you how JavaScript unlocks the power of all of the new functionality in HTML5, giving web applications the capabilities developers have wanted for years. These technologies now provide the raw tools you need in the presentation layer to replace everything you used to do with Flash. You’ll discover how: HTML5 builds natively into the web platform things we find most commonly useful, such as audio, video, and drawing The Canvas element is changing graphic animations, games, audio visualization, charting, and video effects Geolocation has spawned “geofencing” and augmented reality Web Workers allows calculations to be performed in the background, rather than compete with the UI Web Sockets is enabling realtime communication for chat, live tech support, multi-user collaboration, and gaming Mobile device APIs will give web apps direct access the phone’s camera, vibration, and other capabilities",
    "authors": [
      {
        "slug": "kyle-simpson",
        "name": "Kyle Simpson"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "advanced-javascript",
    "thumbnail": "http://books.google.com/books/content?id=BCtt4oHdbyIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Advanced Javascript",
    "description": "Advanced JavaScript, Third Edition provides an in-depth examination of the most important features of JavaScript. Beginning with an overview of JavaScript, the book quickly moves into more advanced features needed for complex yet robust JavaScript scripts, such as objects, arrays, and date and time functions. Additionally, various features of JavaScript that are essential for modern web pages are discussed, including manipulating the status bar, creating dynamic calendars, and working with forms, images, and the Document Object Model. Numerous examples illustrate how to implement various techniques. Topics covered how to enhance your web pages with LED signs, banners, and images; implementing cookies to store and retrieve information; the structure of the Document Object Model and how it can be used to view, access, and change an HTML document; Security measures to protect private information while using the Internet.",
    "authors": [
      {
        "slug": "chuck-easttom",
        "name": "Chuck Easttom"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "effective-javascript",
    "thumbnail": "http://books.google.com/books/content?id=nBuA0hmspdMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Effective JavaScript",
    "description": "“It’s uncommon to have a programming language wonk who can speak in such comfortable and friendly language as David does. His walk through the syntax and semantics of JavaScript is both charming and hugely insightful; reminders of gotchas complement realistic use cases, paced at a comfortable curve. You’ll find when you finish the book that you’ve gained a strong and comprehensive sense of mastery.” —Paul Irish, developer advocate, Google Chrome “This is not a book for those looking for shortcuts; rather it is hard-won experience distilled into a guided tour. It’s one of the few books on JS that I’ll recommend without hesitation.” —Alex Russell, TC39 member, software engineer, Google In order to truly master JavaScript, you need to learn how to work effectively with the language’s flexible, expressive features and how to avoid its pitfalls. No matter how long you’ve been writing JavaScript code, Effective JavaScript will help deepen your understanding of this powerful language, so you can build more predictable, reliable, and maintainable programs. Author David Herman, with his years of experience on Ecma’s JavaScript standardization committee, illuminates the language’s inner workings as never before—helping you take full advantage of JavaScript’s expressiveness. Reflecting the latest versions of the JavaScript standard, the book offers well-proven techniques and best practices you’ll rely on for years to come. Effective JavaScript is organized around 68 proven approaches for writing better JavaScript, backed by concrete examples. You’ll learn how to choose the right programming style for each project, manage unanticipated problems, and work more successfully with every facet of JavaScript programming from data structures to concurrency. Key features include Better ways to use prototype-based object-oriented programming Subtleties and solutions for working with arrays and dictionary objects Precise and practical explanations of JavaScript’s functions and variable scoping semantics Useful JavaScript programming patterns and idioms, such as options objects and method chaining In-depth guidance on using JavaScript’s unique “run-to-completion” approach to concurrency",
    "authors": [
      {
        "slug": "david-herman",
        "name": "David Herman"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "test-driven-javascript-development",
    "thumbnail": "http://books.google.com/books/content?id=W218yMY2MhcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Test-Driven JavaScript Development",
    "description": "For JavaScript developers working on increasingly large and complex projects, effective automated testing is crucial to success. Test-Driven JavaScript Development is a complete, best-practice guide to agile JavaScript testing and quality assurance with the test-driven development (TDD) methodology. Leading agile JavaScript developer Christian Johansen covers all aspects of applying state-of-the-art automated testing in JavaScript environments, walking readers through the entire development lifecycle, from project launch to application deployment, and beyond. Using real-life examples driven by unit tests, Johansen shows how to use TDD to gain greater confidence in your code base, so you can fearlessly refactor and build more robust, maintainable, and reliable JavaScript code at lower cost. Throughout, he addresses crucial issues ranging from code design to performance optimization, offering realistic solutions for developers, QA specialists, and testers. Coverage includes • Understanding automated testing and TDD • Building effective automated testing workflows • Testing code for both browsers and servers (using Node.js) • Using TDD to build cleaner APIs, better modularized code, and more robust software • Writing testable code • Using test stubs and mocks to test units in isolation • Continuously improving code through refactoring • Walking through the construction and automated testing of fully functional software The accompanying Web site, tddjs.com, contains all of the book’s code listings and additional resources.",
    "authors": [
      {
        "slug": "christian-johansen",
        "name": "Christian Johansen"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "maintainable-javascript",
    "thumbnail": "http://books.google.com/books/content?id=bHhlCrvbqSoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Maintainable JavaScript",
    "description": "You may have definite ideas about writing code when working alone, but team development requires that everyone use the same approach. With the JavaScript practices in this book—including code style, programming tips, and automation—you will learn how to write maintainable code that other team members can easily understand, adapt, and extend. Author Nicholas Zakas assembled this collection of best practices as a front-end tech leader at Yahoo!, after completing his own journey from solo hacker to team player. He also includes rules recommended by other industry authorities. Use these tips and techniques to help your team set aside individual preferences and function at a higher level. Establish specific code conventions for your team Use tools such as JSLint and JSHint to keep your team on track Adopt style guidelines, such as basic formatting, to help your team produce uniform code Apply several programming practices to solve problems and improve code quality Create an automated JavaScript build system using a variety of utilities Integrate browser-based JavaScript testing with tools such as the YUI Test Selenium Driver",
    "authors": [
      {
        "slug": "nicholas-c-zakas",
        "name": "Nicholas C. Zakas"
      }
    ],
    "categories": [
      "javascript"
    ]
  },
  {
    "slug": "guide-to-html-javascript-and-php",
    "thumbnail": "http://books.google.com/books/content?id=NTh1O5X47FEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Guide to HTML, JavaScript and PHP",
    "description": "This book enables readers to quickly develop a working knowledge of HTML, JavaScript and PHP. The text emphasizes a hands-on approach to learning and makes extensive use of examples. A detailed science, engineering, or mathematics background is not required to understand the material, making the book ideally suitable for self-study or an introductory course in programming. Features: describes the creation and use of HTML documents; presents fundamental concepts of client-side and server-side programming languages; examines JavaScript and PHP implementation of arrays, built-in and user-defined methods and functions, math capabilities, and input processing with HTML forms; extends programming fundamentals to include reading and writing server-based files, command-line interfaces, and an introduction to GD graphics; appendices include a brief introduction to using a “pseudocode” approach to organizing solutions to computing problems; includes a Glossary and an extensive set of programming exercises.",
    "authors": [
      {
        "slug": "david-r-brooks",
        "name": "David R. Brooks"
      }
    ],
    "categories": [
      "javascript",
      "html"
    ]
  },
  {
    "slug": "html-and-javascript-basics",
    "thumbnail": "http://books.google.com/books/content?id=nDNkPhU5kAoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "HTML and JavaScript BASICS",
    "description": "This BASICS series text, updated to include the latest information on JavaScript and HTML, provides an easy-to-follow, step-by-step introduction to all aspects of HTML and JavaScript programming. Topics covered in the book include HTML organization techniques, HTML power techniques, using images with JavaScript, and using forms with JavaScript. Important Notice: Media content referenced within the product description or the product text may not be available in the ebook version.",
    "authors": [
      {
        "slug": "karl-barksdale",
        "name": "Karl Barksdale"
      },
      {
        "slug": "e-turner",
        "name": "E. Turner"
      }
    ],
    "categories": [
      "javascript",
      "html"
    ]
  },
  {
    "slug": "an-introduction-to-html-and-javascript",
    "thumbnail": "http://books.google.com/books/content?id=MPPy5KpAZQ0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "An Introduction to HTML and JavaScript",
    "description": "Dual-use technological writing at its best. This book presents HTML and JavaScript in a way that uniquely meets the needs of students in both engineering and the sciences. The author shows how to create simple client-side applications for scientific and engineering calculations. Complete HTML/JavaScript examples with science/engineering applications are used throughout to guide the reader comprehensively through the subject. The book gives the reader a sufficient understanding of HTML and JavaScript to write their online applications. This book emphasises basic programming principles in a modern Web-oriented environment, making it suitable for an introductory programming course for non-computer science majors. It is also ideal for self-study.",
    "authors": [
      {
        "slug": "david-r-brooks",
        "name": "David R. Brooks"
      }
    ],
    "categories": [
      "javascript",
      "html"
    ]
  },
  {
    "slug": "building-android-apps-with-html-css-and-javascript",
    "thumbnail": "http://books.google.com/books/content?id=zWndz5OpUzgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Building Android Apps with HTML, CSS, and JavaScript",
    "description": "If you know HTML, CSS, and JavaScript, you already have the tools you need to develop Android applications. Now updated for HTML5, the second edition of this hands-on guide shows you how to use open source web standards to design and build apps that can be adapted for any Android device. You’ll learn how to create an Android-friendly web app on the platform of your choice, and then use Adobe’s free PhoneGap framework to convert it to a native Android app. Discover why device-agnostic mobile apps are the wave of the future, and start building apps that offer greater flexibility and a much broader reach. Convert a website into a web application, complete with progress indicators and other features Add animation with JQTouch to make your web app look and feel like a native Android app Make use of client-side data storage with apps that run when the Android device is offline Use PhoneGap to hook into advanced Android features, including the accelerometer, geolocation, and alerts Test and debug your app on the Web with real users, and submit the finished product to the Android Market",
    "authors": [
      {
        "slug": "jonathan-stark",
        "name": "Jonathan Stark"
      },
      {
        "slug": "brian-jepson",
        "name": "Brian Jepson"
      },
      {
        "slug": "brian-macdonald",
        "name": "Brian MacDonald"
      }
    ],
    "categories": [
      "javascript",
      "html"
    ]
  },
  {
    "slug": "custom-sharepoint-solutions-with-html-and-javascript",
    "thumbnail": "http://books.google.com/books/content?id=-4cnCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Custom SharePoint Solutions with HTML and JavaScript",
    "description": "Custom SharePoint Solutions with HTML and JavaScript shows you how to build and customize SharePoint solutions to suit a wide range of business needs. You don't need a background in Microsoft technologies; you’ll learn how to rapidly build and customize sites entirely on the front end, starting with out-of-the-box features and extending them with HTML and JavaScript code. The book starts with an introduction to working with SharePoint on the front end, and how this can help you avoid common pitfalls associated with deploying custom code on the server. You’ll start by using SharePoint’s browser-based tools to place and manipulate out-of-the-box web parts on a page. Then learn to inject some simple HTML and JavaScript to manipulate these web parts, and use JSLink to rapidly style and manipulate data in the List web part. You'll also see examples of how to build your own custom web parts using HTML, JavaScript and CSS. For those who want to dive deeper into JavaScript on SharePoint, chapters cover working directly with built-in JavaScript methods and properties and the JavaScript object model (JSOM), and how to work with the powerful new REST API, which gives you the ultimate flexibility over what you do with your data. Whatever your background, whether it's web development, working with SharePoint on the server side, or if you're a SharePoint user looking to learn new skills, Custom SharePoint Solutions with HTML and JavaScript will show you how to get what you want from SharePoint, quickly and reliably.",
    "authors": [
      {
        "slug": "brandon-atkinson",
        "name": "Brandon Atkinson"
      }
    ],
    "categories": [
      "javascript",
      "html"
    ]
  },
  {
    "slug": "html-css-and-javascript-mobile-development-for-dummies",
    "thumbnail": "http://books.google.com/books/content?id=f5_qAWoWTHEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "HTML, CSS, and JavaScript Mobile Development For Dummies",
    "description": "Learn to build and optimize attractive, functional web sites for smartphones Today, mobile devices outnumber desktop and laptop computers three to one. Skill in developing web sites that work on mobile devices is in demand, and this friendly, step-by-step guide shows how to build and optimize sites using HTML5 and other standard web development tools. Building web sites that work for all types of smartphones and tablets, including iPhones, iPads, Android devices, and BlackBerry devices is a skill much in demand as mobile devices outpace both desktop and laptop computers, and this book gets you started. Guides you through creating and optimizing mobile sites with HTML, CSS, and JavaScript Covers HTML5, WebKit extensions, platform variations, accommodating different browsers, security issues, and making mobile sites richer with Flash, graphics, and video Includes code for differences in mobile app design and navigation, including touch devices HTML, CSS, and JavaScript Mobile Web Development For Dummies makes it easy to start developing great sites for mobile devices.",
    "authors": [
      {
        "slug": "william-harrel",
        "name": "William Harrel"
      }
    ],
    "categories": [
      "javascript",
      "html"
    ]
  },
  {
    "slug": "start-programming-using-html-css-and-javascript",
    "thumbnail": "http://books.google.com/books/content?id=eHq9CgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Start Programming Using HTML, CSS, and JavaScript",
    "description": "A Beginner’s Guide to Computer Programming Start Programming Using HTML, CSS, and JavaScript is a manual for undergraduate students in engineering and the natural sciences to discover how computer programming works. Using a dialog format between two students and a professor, the text teaches students how the mainstream web languages HTML, CSS, and JavaScript interact and how to harness their capabilities in practical settings. Each chapter focuses on a specific theme supported by a gradual development of engaging worked examples of live web documents and applications using the three languages. Students can follow most of the examples and experiments using any modern browser and plain text editor. A practical homework problem is included at the end of every chapter and then is discussed at the beginning of the next chapter. In addition, a related keywords list helps students review key topics. By focusing on important established principles and concrete examples, this introductory book shows students how to write cleaner and more easily maintainable code. It augments the basic language syntax and rules with contents and structure while keeping the material simple and manageable.",
    "authors": [
      {
        "slug": "iztok-fajfar",
        "name": "Iztok Fajfar"
      }
    ],
    "categories": [
      "javascript",
      "html"
    ]
  },
  {
    "slug": "html-css-and-javascript-all-in-one-sams-teach-yourself",
    "thumbnail": "http://books.google.com/books/content?id=0U6nBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "HTML, CSS and JavaScript All in One, Sams Teach Yourself",
    "description": "In just a short time, you can learn how to use HTML5, Cascading Style Sheets (CSS3), and JavaScript together to design, create, and maintain world-class websites. Using a straightforward, step-by-step approach, each lesson in this book builds on the previous ones, enabling you to learn the essentials from the ground up. Clear instructions and practical, hands-on examples show you how to use HTML to create the framework of your website, design your site's layout and typography with CSS, and then add interactivity with JavaScript and jQuery. Step-by-step instructions carefully walk you through the most common web development tasks Practical, hands-on examples show you how to apply what you learn Quizzes and exercises help you test your knowledge and stretch your skills Learn how to... Build your own web page and get it online in an instant Format text for maximum clarity and readability Create links to other pages and to other sites Add graphics, color, and visual pizzazz to your web pages Work with transparent images and background graphics Design your site’s layout and typography using CSS Get user input with web-based forms Use JavaScript to build dynamic, interactive web pages Add AJAX effects to your web pages Leverage JavaScript libraries such as jQuery Make your site easy to maintain and update as it grows Contents at a Glance Part I Getting Started on the Web 1 Understanding How the Web Works 2 Structuring an HTML Document 3 Understanding Cascading Style Sheets 4 Understanding JavaScript 5 Validating and Debugging Your Code Part II Building Blocks of Practical Web Design 6 Working with Fonts, Text Blocks, Lists, and Tables 7 Using External and Internal Links 8 Working with Colors, Images, and Multimedia Part III Advanced Web Page Design with CSS 9 Working with Margins, Padding, Alignment, and Floating 10 Understanding the CSS Box Model and Positioning 11 Using CSS to Do More with Lists, Text, and Navigation 12 Creating Fixed or Liquid Layouts Part IV Getting Started with Dynamic Sites 13 Understanding Dynamic Websites and HTML5 Applications 14 Getting Started with JavaScript Programming 15 Working with the Document Object Model (DOM) 16 Using JavaScript Variables, Strings, and Arrays 17 Using JavaScript Functions and Objects 18 Controlling Flow with Conditions and Loops 19 Responding to Events 20 Using Windows Part V Advanced JavaScript Programming 21 JavaScript Best Practices 22 Using Third-Party JavaScript Libraries and Frameworks 23 A Closer Look at jQuery 24 First Steps Toward Creating Rich Interactions with jQuery UI 25 AJAX: Remote Scripting Part VI Advanced Website Functionality and Management 26 Working with Web-Based Forms 27 Organizing and Managing a Website",
    "authors": [
      {
        "slug": "julie-c-meloni",
        "name": "Julie C. Meloni"
      }
    ],
    "categories": [
      "javascript",
      "html"
    ]
  },
  {
    "slug": "html-css-javascript-web-publishing-in-one-hour-a-day-sams-teach-yourself",
    "thumbnail": "http://books.google.com/books/content?id=L9tACwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "HTML, CSS & JavaScript Web Publishing in One Hour a Day, Sams Teach Yourself",
    "description": "Thoroughly revised and updated with examples rewritten to conform to HTML5, CSS3, and contemporary web development practices, this easy-to-understand, step-by-step tutorial helps you quickly master the basics of HTML and CSS before moving on to more advanced topics such as graphics, video, and interactivity with JavaScript and jQuery. In just one hour a day, you’ll learn the skills you need to design, create, and maintain a professional-looking website. No previous experience required. By following each short, one-hour lesson in this book, anyone can learn the basics of web development. Learn at your own pace. You can work through each lesson sequentially to make sure you thoroughly understand all the concepts and methodologies, or you can focus on specific lessons to learn the techniques that interest you most. Test your knowledge. Each lesson ends with a Workshop section filled with questions, answers, and exercises for further study. Learn how to... Fully implement the HTML5 and CSS3 standards Work with text and create links Add images and graphics to your page Use CSS to style a site and position elements on a page Structure a page with HTML5 Use responsive web design to make your pages look good on different-sized screens Use JavaScript to add dynamic elements and interactivity on your pages Leverage jQuery to add JavaScript features to your pages Design for the mobile web Get your site online and let people know it’s there Optimize your site for search engines Contents at a Glance PART I: Getting Started 1 What Is Web Publishing 2 Getting Your Tools in Order 3 Introducing HTML and CSS PART II: Creating Web Pages 4 Learning the Basics of HTML 5 Organizing Information with Lists 6 Working with Links PART III: Doing More with HTML and CSS 7 Formatting Text with HTML and CSS 8 Using CSS to Style a Site 9 Using Images on Your Web Pages 10 Building Tables 11 Using CSS to Position Elements on a Page 12 Designing Forms 13 Structuring a Page with HTML5 14 Integrating Multimedia: Video and Sound 15 Advanced CSS: Page Layout in CSS 16 Using Responsive Web Design PART IV: Using JavaScript and jQuery 17 Introducing JavaScript 18 Using jQuery 19 Using JavaScript in Your Pages 20 Working with Frames and Linked Windows PART V: Designing for Everyone 21 Designing for the Mobile Web 22 Designing for User Experience PART VI: Going Live on the Web 23 How to Publish Your Site 24 Taking Advantage of the Server 25 Search Engines and SEO",
    "authors": [
      {
        "slug": "laura-lemay",
        "name": "Laura Lemay"
      },
      {
        "slug": "rafe-colburn",
        "name": "Rafe Colburn"
      },
      {
        "slug": "jennifer-kyrnin",
        "name": "Jennifer Kyrnin"
      }
    ],
    "categories": [
      "javascript",
      "html"
    ]
  },
  {
    "slug": "programming-windows-store-apps-with-html-css-and-javascript",
    "thumbnail": "http://books.google.com/books/content?id=eBINBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Programming Windows Store Apps with HTML, CSS, and JavaScript",
    "description": "Microsoft Press is pleased to offer the second edition of Kraig Brockschmidt's in-depth ebook on writing Windows Store apps using HTML, CSS3, and JavaScript on the Windows 8.1 platform. The ebook includes 20 chapters and 4 appendices. Download the PDF (30.1 MB) http://aka.ms/611111pdf Download the EPUB file (71.2 MB) http://aka.ms/611111epub Download the Mobi for Kindle file (113 MB) http://aka.ms/611111mobi Download Companion Files (132 MB) http://aka.ms/611111files",
    "authors": [
      {
        "slug": "kraig-brockschmidt",
        "name": "Kraig Brockschmidt"
      }
    ],
    "categories": [
      "javascript",
      "html"
    ]
  },
  {
    "slug": "beginning-html-xhtml-css-and-javascript",
    "thumbnail": "http://books.google.com/books/content?id=vOZLwYJHymQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Beginning HTML, XHTML, CSS, and JavaScript",
    "description": "An indispensable introductory guide to creating web pages using the most up-to-date standards This beginner guide shows you how to use XHTML, CSS, and JavaScript to create compelling Web sites. While learning these technologies, you will discover coding practices such as writing code that works on multiple browsers including mobile devices, how to use AJAX frameworks to add interactivity to your pages, and how to ensure your pages meet accessible requirements. Packed with real-world examples, the book not only teaches you how to write Web sites using XHTML, CSS and JavaScript, but it also teaches you design principles that help you create attractive web sites and practical advice on how to make web pages more usable. In addition, special checklists and appendices review key topics and provide helpful references that re-enforce the basics you've learned. Serves as an ideal beginners guide to writing web pages using XHTML Explains how to use CSS to make pages more appealing and add interactivity to pages using JavaScript and AJAX frameworks Share advice on design principles and how to make pages more attractive and offers practical help with usability and accessibility Features checklists and appendices that review key topics This introductory guide is essential reading for getting started with using XHTML, CSS and JavaScript to create exciting and compelling Web sites. Note: CD-ROM/DVD and other supplementary materials are not included as part of eBook file.",
    "authors": [
      {
        "slug": "jon-duckett",
        "name": "Jon Duckett"
      }
    ],
    "categories": [
      "javascript",
      "html"
    ]
  },
  {
    "slug": "beginning-ios-application-development-with-html-and-javascript",
    "thumbnail": "http://books.google.com/books/content?id=0LAp57hYSooC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Beginning iOS Application Development with HTML and JavaScript",
    "description": "",
    "authors": [
      {
        "slug": "richard-wagner",
        "name": "Richard Wagner"
      }
    ],
    "categories": [
      "javascript",
      "html"
    ]
  },
  {
    "slug": "beginning-windows-store-application-development-html-and-javascript-edition",
    "thumbnail": "http://books.google.com/books/content?id=ERTgAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Beginning Windows Store Application Development: HTML and JavaScript Edition",
    "description": "Beginning Windows Store Application Development – HTML and JavaScript Edition introduces you to the Windows 8 modern app design paradigm and the new Windows 8 programming model developed around this paradigm. You'll learn to build rich, immersive applications designed to run on the many devices powered by Windows 8. The authors draw on their extensive practical experience to provide not only a comprehensive introduction to the model and its features, but guidance on best practices and a real-world sample application that you develop over the course of the book. Beginning Windows Store Application Development – HTML and JavaScript Edition also emphasizes how devices will be used and applications will be built in a world that has become far more connected. The book takes you beyond the syntax of any development language and examines factors such as application design, user experience, social integration, and maintaining data and settings across multiple devices.",
    "authors": [
      {
        "slug": "scott-isaacs",
        "name": "Scott Isaacs"
      },
      {
        "slug": "kyle-burns",
        "name": "Kyle Burns"
      }
    ],
    "categories": [
      "javascript",
      "html"
    ]
  },
  {
    "slug": "html-javascript-for-visual-learners",
    "thumbnail": "http://books.google.com/books/content?id=TGvPwDzbUNAC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "HTML & JavaScript for Visual Learners",
    "description": "",
    "authors": [
      {
        "slug": "chris-charuhas",
        "name": "Chris Charuhas"
      }
    ],
    "categories": [
      "javascript",
      "html"
    ]
  },
  {
    "slug": "javascript-based-html-editors",
    "thumbnail": "http://books.google.com/books/content?id=NVjKLIj0808C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Javascript-Based Html Editors",
    "description": "",
    "authors": [
      {
        "slug": "general-books-llc",
        "name": "General Books LLC"
      }
    ],
    "categories": [
      "javascript",
      "html"
    ]
  },
  {
    "slug": "web-coding-bible-html-css-javascript-php-sql-xml-svg-canvas-webgl-java-applet-actionscript-jquery-wordpress-seo-and-many-more",
    "thumbnail": "http://books.google.com/books/content?id=5hhbBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Web Coding Bible (HTML, CSS, Javascript, PHP, SQL, XML, SVG, Canvas, WebGL, Java Applet, ActionScript, jQuery, WordPress, SEO and many more)",
    "description": "This fixed-layout eBook teaches all essential web technologies from A to Z. Skillfully written, extremely succinct, with a lot of tables, diagrams, examples and screen output, it touches the latest experimental technology in action. Covering some hardly documented 'tricks' beyond the basics, this book guarantees to transform an Internet newcomer to an accomplished web developer. For every web developer, it is a handy must-have. As we know, various web technologies are interconnected and it is impossible to fully master one technology without knowing another. Traditionally, a serious web developer needs to rely on several books or sources when coding a website. This book represents an all-in-one solution. It presents to you a holistic view of all essential web technologies. It means spending less money and time in learning more. The topics include HTML, CSS, JavaScript, PHP, AJAX, SQL, XML, XPath, XSD, XQuery, XSLT, SVG, Canvas, WebGL, Java Applet, Flash ActionScript, Red5, Firebase, WebRTC, htaccess, mod rewrite, jQuery, cURL, WordPress, SEO etc. (This eBook should be read using a fixed-layout-compatible (epub3) reader such as the Gitden Reader in Android.)",
    "authors": [
      {
        "slug": "chong-lip-phang",
        "name": "Chong Lip Phang"
      }
    ],
    "categories": [
      "javascript",
      "html"
    ]
  },
  {
    "slug": "more-excellent-html-with-an-introduction-to-javascript",
    "thumbnail": "http://books.google.com/books/content?id=Uf0O1ziLhokC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "More excellent HTML with an introduction to JavaScript",
    "description": "Unique in the marketplace, More Excellent HTML combines the pedagogical support of academic texts with the comprehensive coverage found in tradebooks. HTML texts from other academic publishers treat HTML in a step-by-step cookbook fashion, as though it were a simple software application, limiting the amount of material and concepts covered. Our text can target both classes now using tradebooks (Teach Yourself Web Publishing, Lemay and Visual QuickStart Guide to HTML, Castro) or those using HTML texts. No previous knowledge of HTML or Web design is assumed.",
    "authors": [
      {
        "slug": "timothy-t-gottleber",
        "name": "Timothy T. Gottleber"
      },
      {
        "slug": "timothy-n-trainor",
        "name": "Timothy N. Trainor"
      }
    ],
    "categories": [
      "javascript",
      "html"
    ]
  },
  {
    "slug": "html-javascript-and-advanced-internet-technologies",
    "thumbnail": "http://books.google.com/books/content?id=S3_gAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "HTML, JavaScript, and Advanced Internet Technologies",
    "description": "This book provides a step-by-step introduction to HTML, JavaScript, and other advanced Internet technologies including XML, XHTML and XSL. Created with first time learners in mind this text covers the most important elements of HTML, JavaScript, and advanced Internet programming without getting bogged down in the details.",
    "authors": [
      {
        "slug": "karl-barksdale",
        "name": "Karl Barksdale"
      },
      {
        "slug": "e-shane-turner",
        "name": "E. Shane Turner"
      }
    ],
    "categories": [
      "javascript",
      "html"
    ]
  },
  {
    "slug": "html-javascript",
    "thumbnail": "http://books.google.com/books/content?id=WN1Yvi-ClPMC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "HTML & JavaScript",
    "description": "Learn the programming basics behind creating Web Pages with HTML & JavaScript Programming Concepts.",
    "authors": [
      {
        "slug": "e-shane-turner",
        "name": "E. Shane Turner"
      },
      {
        "slug": "karl-barksdale",
        "name": "Karl Barksdale"
      }
    ],
    "categories": [
      "javascript",
      "html"
    ]
  },
  {
    "slug": "animation-in-html-css-and-javascript",
    "thumbnail": "http://books.google.com/books/content?id=47ffoQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Animation in HTML, CSS, and JavaScript",
    "description": "This book will help you create practical / usable / wickedly-cool animations in HTML, CSS, and JavaScript. Each chapter is filled with cleanly explained concepts, beautifully illustrated diagrams, colorific code snippets, and cringeworthy one-liners guaranteed to make your friend who laughs at everything groan. You will start by learning how to create animations and transitions in CSS. Towards the end, you will learn how to create animations in JavaScript by manipulating DOM elements as well as pushing pixels on the canvas. Along the way, you will see numerous small and large examples explaining how what you are learning applies to what is done in the real world. If you ever get stuck or need a group of friendly people to help you out with your animation-related issues, get free online support, demos, video tutorials, and other good stuff at: http://www.kirupa.com",
    "authors": [
      {
        "slug": "kirupa-chinnathambi",
        "name": "Kirupa Chinnathambi"
      }
    ],
    "categories": [
      "javascript",
      "html"
    ]
  },
  {
    "slug": "create-code-using-html-and-javascript-icaitb070a",
    "thumbnail": "http://books.google.com/books/content?id=NVjKLIj0808C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Create Code Using HTML and JavaScript, ICAITB070A.",
    "description": "",
    "authors": [],
    "categories": [
      "javascript",
      "html"
    ]
  },
  {
    "slug": "an-introduction-to-computer-programming-for-complete-beginners-using-html-javascript-and-c",
    "thumbnail": "http://books.google.com/books/content?id=NVjKLIj0808C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "An Introduction to Computer Programming for Complete Beginners Using HTML, JavaScript, and C♯",
    "description": "",
    "authors": [
      {
        "slug": "rembert-n-parker",
        "name": "Rembert N. Parker"
      }
    ],
    "categories": [
      "javascript",
      "html"
    ]
  },
  {
    "slug": "web-design-with-html-css-javascript-and-jquery-set",
    "thumbnail": "http://books.google.com/books/content?id=iIfBoQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Web Design with HTML, CSS, JavaScript and jQuery Set",
    "description": "A two-book set for web designers and front-end developers This two-book set combines the titles HTML & CSS: Designing and Building Web Sites and JavaScript & jQuery: Interactive Front-End Development. Together these two books form an ideal platform for anyone who wants to master HTML and CSS before stepping up to JavaScript and jQuery. HTML & CSS covers structure, text, links, images, tables, forms, useful options, adding style with CSS, fonts, colors, thinking in boxes, styling lists and tables, layouts, grids, and even SEO, Google analytics, ftp, and HTML5. JavaScript & jQuery offers an excellent combined introduction to these two technologies using a clear and simple visual approach using diagrams, infographics, and photographs. A handy two-book set that uniquely combines related technologies Highly visual format and accessible language makes these books highly effective learning tools Perfect for beginning web designers and front-end developers",
    "authors": [
      {
        "slug": "jon-duckett",
        "name": "Jon Duckett"
      }
    ],
    "categories": [
      "javascript",
      "html"
    ]
  },
  {
    "slug": "getting-started-with-meteor-javascript-framework",
    "thumbnail": "http://books.google.com/books/content?id=PTn2QeLMRNcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Getting Started with Meteor JavaScript Framework",
    "description": "Written in an engaging, easy-to-follow style, \"Getting Started with Meteor\" is a practical guide for developing modern web applications with Meteor. This book is for developers or students who have a working knowledge of JavaScript and HTML, and want to learn how to quickly develop web applications using pure JavaScript. A basic understanding of traditional web server development and database methodologies will be helpful, but not necessary. Readers are expected to know how to program basic HTML pages and JavaScript functions, and be familiar with Terminal (basic Shell) commands.",
    "authors": [
      {
        "slug": "isaac-strack",
        "name": "Isaac Strack"
      }
    ],
    "categories": [
      "javascript",
      "html"
    ]
  },
  {
    "slug": "beginning-javascript",
    "thumbnail": "http://books.google.com/books/content?id=skdllULn0yoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Beginning JavaScript",
    "description": "What is this book about? JavaScript is the preferred programming language for Web page applications, letting you enhance your sites with interactive, dynamic, and personalized pages. This fully updated guide shows you how to take advantage of JavaScript’s client-side scripting techniques for the newest versions of Netscape and Internet Explorer, even if you’ve never programmed before. You begin with basic syntax and learn about data types and how to structure code for decision-making. Then you learn to use dates, strings, and other basic objects of JavaScript. Next, you see how to use JavaScript to manipulate objects provided by the browser, such as forms and windows. From there, you move into advanced topics like using cookies and dynamic HTML. After you have a solid foundation, you explore dynamic generation of Web content using server-side scripting and back-end databases. And you practice what you learn by building a sample application as you go. What does this book cover? Here are some of the things you'll find in this book: What types of data are used in JavaScript How to identify and correct flaws in your code Techniques for programming the browser How to use Microsoft Script Debugger and Netscape Script Debugger Ways to manage cross-browser issues How JavaScript interacts with XML and HTML Who is this book for? This book is for anyone who wants to learn JavaScript programming. You should have some understanding of HTML and how to create static Web pages, but no prior programming experience is necessary.",
    "authors": [
      {
        "slug": "paul-wilton",
        "name": "Paul Wilton"
      }
    ],
    "categories": [
      "javascript",
      "html"
    ]
  },
  {
    "slug": "learning-php-mysql-javascript-and-css",
    "thumbnail": "http://books.google.com/books/content?id=8-QyaeyEXHkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Learning PHP, MySQL, JavaScript, and CSS",
    "description": "Provides information on creating interactive Web sites using a combination of PHP, MySQL, JavaScript, and CSS.",
    "authors": [
      {
        "slug": "robin-nixon",
        "name": "Robin Nixon"
      }
    ],
    "categories": [
      "javascript",
      "css"
    ]
  },
  {
    "slug": "beginning-javascript-and-css-development-with-jquery",
    "thumbnail": "http://books.google.com/books/content?id=L9otyT4crSQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Beginning JavaScript and CSS Development with jQuery",
    "description": "This book covers the jQuery JavaScript framework and the jQuery UI JavaScript framework to get more results faster out of JavaScript programming. The author covers each method exposed by jQuerys API, which contains methods to resolve common, redundant tasks in less code. You will also learn how jQuery eliminates certain cross-browser, cross-platform development headaches like the event model. In addition to giving you the ability to simulate events, this book also helps simplify your work with events by reducing the amount of code that you need to write to attach events.",
    "authors": [
      {
        "slug": "richard-york",
        "name": "Richard York"
      }
    ],
    "categories": [
      "javascript",
      "css"
    ]
  },
  {
    "slug": "foundation-website-creation-with-css-xhtml-and-javascript",
    "thumbnail": "http://books.google.com/books/content?id=295iDEn7YCYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Foundation Website Creation with CSS, XHTML, and JavaScript",
    "description": "Foundation Website Creation with CSS, XHTML, and JavaScript covers the entire process of building a website. This process involves much more than just technical knowledge, and this book provides you with all the information you'll need to understand the concepts behind designing and developing for the Web, as well as the best means to deliver professional, best-practice-based results. There is far more to building a successful website than knowing a little Hypertext Markup Language (HTML). The process starts long before any coding takes place, and this book introduces you to the agile development process, explaining why this method makes so much sense for web projects and how best to implement it. Planning is vital, so you'll also learn how to use techniques such as brainstorming, wireframes, mockups, and prototypes to get your project off to the best possible start and help ensure smooth progress as it develops. An understanding of correct, semantic markup is essential to any web professional, so this book explains how XHTML should be used to structure content so that the markup adheres to current web standards. You'll learn about the wide range of HTML elements available to you, and you'll learn how and when to use them through building example web pages. Without creative use of Cascading Style Sheets (CSS), websites would all look largely the same. CSS gives you the ability to set your website apart from the rest while maintaining the integrity of your markup. You'll learn how CSS works and how to apply styles to your pages, enabling you to realize your design ideas in the browser. JavaScript can be used to make your website easier and more interesting to use. This book provides information on appropriate uses of this technology and introduces the concepts of programming using it. You'll also see how JavaScript works as part of the much-hyped technique Ajax and in turn where Ajax fits into the wider Web 2.0 picture. While a website is being built, it needs to be tested across multiple browsers and platforms to ensure that the site works for all users, regardless of ability or disability, and the book explains how best to do these tasks. Then, it discusses the process of launching and maintaining the site so that it will continue to work for all its users throughout its life-cycle. The book concludes by covering server-side technologies, acting as a guide to the different options available and explaining differences between available products. With insights from renowned experts such as Jason Fried of 37signals, Daniel Burka of Digg and Pownce, and Chris Messina of Citizen Agency, this book provides invaluable information applicable to every web project, regardless of size, scope, or budget.",
    "authors": [
      {
        "slug": "steve-smith",
        "name": "Steve Smith"
      },
      {
        "slug": "jonathan-lane",
        "name": "Jonathan Lane"
      }
    ],
    "categories": [
      "javascript",
      "css"
    ]
  },
  {
    "slug": "sams-teach-yourself-html-css-and-javascript-all-in-one",
    "thumbnail": "http://books.google.com/books/content?id=LS3qWhojG2gC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Sams Teach Yourself HTML, CSS, and JavaScript All in One",
    "description": "Sams Teach Yourself HTML, CSS and JavaScript All in One The all-in-one HTML, CSS and JavaScript beginner's guide: covering the three most important languages for web development. Covers everything beginners need to know about the HTML and CSS standards and today's JavaScript and Ajax libraries - all in one book, for the first time Integrated, well-organized coverage expertly shows how to use all these key technologies together Short, simple lessons teach hands-on skills readers can apply immediately By best-selling author Julie Meloni Mastering HTML, CSS, and JavaScript is vital for any beginning web developer - and the importance of these technologies is growing as web development moves away from proprietary alternatives such as Flash. Sams Teach Yourself HTML, CSS, and JavaScript All in One brings together everything beginners need to build powerful web applications with the HTML and CSS standards and the latest JavaScript and Ajax libraries. With this book, beginners can get all the modern web development knowledge you need from one expert source. Bestselling author Julie Meloni (Sams Teach Yourself PHP, MySQL and Apache All in One) teaches simply and clearly, through brief, hands-on lessons focused on knowledge you can apply immediately. Meloni covers all the building blocks of practical web design and development, integrating new techniques and features into every chapter. Each lesson builds on what's come before, showing you exactly how to use HTML, CSS, and JavaScript together to create great web sites.",
    "authors": [
      {
        "slug": "julie-c-meloni",
        "name": "Julie C. Meloni"
      }
    ],
    "categories": [
      "javascript",
      "css"
    ]
  },
  {
    "slug": "javascript-css-dom-magic",
    "thumbnail": "http://books.google.com/books/content?id=NkqBXV-6UB8C&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "JavaScript + CSS + DOM Magic",
    "description": "JavaScript + CSS + DOM Magic has directly applicable projects with step-by-step instructions showing you how to master a feature and adapt it according to their own needs and creativity. The wealth of graphics will make this book easy to read and visually appealing. This book makes JavaScript, CSS and DOM easy to understand by providing directly applicable models to readers' web sites. The book opens with a primer, giving context to the technologies, and then jumps into over 25 step-by-step, directly applicable projects. You will learn the most desired web functionalities, including: frames, mouse-overs, windows, forms, CGI, style sheets, dynamic positioning, and SSI. Reviewers have called this book an unprecedented practical and comprehensive DHTML guide. The CD contains complete working scripts, all images from the book's examples, bonus graphics, trial version of leading text editors (BBEdit Lite, Homesite).",
    "authors": [
      {
        "slug": "makiko-itoh",
        "name": "Makiko Itoh"
      }
    ],
    "categories": [
      "javascript",
      "css"
    ]
  },
  {
    "slug": "javascript-the-missing-manual",
    "thumbnail": "http://books.google.com/books/content?id=CxY3lNQTATQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "JavaScript: The Missing Manual",
    "description": "JavaScript is an essential language for creating modern, interactive websites, but its complex rules challenge even the most experienced web designers. With JavaScript: The Missing Manual, you'll quickly learn how to use JavaScript in sophisticated ways -- without pain or frustration -- even if you have little or no programming experience. JavaScript expert David McFarland first teaches you the basics by having you build a simple program. Then you'll learn how to work with jQuery, a popular library of pre-built JavaScript components that's free and easy to use. With jQuery, you can quickly build modern, interactive web pages -- without having to script everything from scratch! Learn how to add scripts to a web page, store and manipulate information, communicate with the browser window, respond to events like mouse clicks and form submissions, and identify and modify HTML Get real-world examples of JavaScript in action Learn to build pop-up navigation bars, enhance HTML tables, create an interactive photo gallery, and make web forms more usable Create interesting user interfaces with tabbed panels, accordion panels, and pop-up dialog boxes Learn to avoid the ten most common errors new programmers make, and how to find and fix bugs Use JavaScript with Ajax to communicate with a server so that your web pages can receive information without having to reload",
    "authors": [
      {
        "slug": "david-sawyer-mcfarland",
        "name": "David Sawyer McFarland"
      }
    ],
    "categories": [
      "javascript",
      "css"
    ]
  },
  {
    "slug": "learning-php-mysql-javascript",
    "thumbnail": "http://books.google.com/books/content?id=_3mrBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Learning PHP, MySQL & JavaScript",
    "description": "Build interactive, data-driven websites with the potent combination of open-source technologies and web standards, even if you have only basic HTML knowledge. With this popular hands-on guide, you’ll tackle dynamic web programming with the help of today’s core technologies: PHP, MySQL, JavaScript, jQuery, CSS, and HTML5. Explore each technology separately, learn how to use them together, and pick up valuable web programming practices along the way. At the end of the book, you’ll put everything together to build a fully functional social networking site, using XAMPP or any development stack you choose. Learn PHP in-depth, along with the basics of object-oriented programming Explore MySQL, from database structure to complex queries Use the MySQLi Extension, PHP’s improved MySQL interface Create dynamic PHP web pages that tailor themselves to the user Manage cookies and sessions, and maintain a high level of security Master the JavaScript language—and enhance it with jQuery Use Ajax calls for background browser/server communication Acquire CSS2 and CSS3 skills for professionally styling your web pages Implement all of the new HTML5 features, including geolocation, audio, video, and the canvas",
    "authors": [
      {
        "slug": "robin-nixon",
        "name": "Robin Nixon"
      }
    ],
    "categories": [
      "javascript",
      "css"
    ]
  },
  {
    "slug": "professional-web-20-programming-using-xhtml-css-javascript-and-ajax",
    "thumbnail": "http://books.google.com/books/content?id=DLg8UzPp1QMC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "PROFESSIONAL WEB 2.0 PROGRAMMING: USING XHTML, CSS, JAVASCRIPT AND AJAX",
    "description": "Market_Desc: · Professional Web Developers Special Features: · Wrox!· The first book to cover the many Web 2.0 approaches (Ajax, Ruby on Rails, service oriented applications, and more) in one place and with a unified vision for developers implementing them· Implementing these ideas well requires a different approach to developing web applications - whether the developer is working with one or several of the web 2.0 components - and that approach is a central unifying theme of the book· Stresses how to get the many Web 2.0 technologies - XHTML, CSS, Javascript, XML, RSS, server programming - to work together rather than teaching each of them individually· Written by a respected member of the open standards community and experienced author About The Book: After beginning by showing the links between the business requirements and the attempt to provide better Web 2.0 user experience, Professional Web 2.0 Programming dives into code with several example application parts built with popular frameworks such as Ruby on Rails and Orbeon Presentation Server. It then moves on to some of the core client-side Web 2.0 techniques followed by an investigation of how clients and servers communicate and finishing with the details on server side techniques.",
    "authors": [
      {
        "slug": "eric-van-der",
        "name": "Eric Van Der"
      },
      {
        "slug": "danny-ayers",
        "name": "Danny Ayers"
      },
      {
        "slug": "erik-bruchez",
        "name": "Erik Bruchez"
      }
    ],
    "categories": [
      "javascript",
      "css"
    ]
  },
  {
    "slug": "pro-android-web-apps",
    "thumbnail": "http://books.google.com/books/content?id=pZlF7lQY5SQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Pro Android Web Apps",
    "description": "Developing applications for Android and other mobile devices using web technologies is now well within reach. When the capabilities of HTML5 are combined with CSS3 and JavaScript, web application developers have an opportunity to develop compelling mobile applications using familiar tools. Not only is it possible to build mobile web apps that feel as good as native apps, but to also write an application once and have it run a variety of different devices. While the HTML5 specification is still evolving, there is a lot that can be used right now to build mobile web apps. Mobile web apps are now starting to provide many of the features that were once only available to native-language-based apps in Java, Objective-C, etc. Pro Android Web Apps teaches developers already familiar with web application development, how to code and structure a web app for use on the Android mobile platform. Understand both the why and how of mobile web app development, focusing on the Android platform. Learn how to structure mobile web apps through a number of practical, real-world application examples. Discover what cloud platforms such as Google AppEngine have to offer Android web apps, for both hosting web apps and providing device to cloud data synchronization solutions. Get a real picture of the status of HTML5 on Android and other mobile devices, including some things to watch out for when building your own applications. Understand the capabilities of the web application stack, and how to complement those with native bridging frameworks such as PhoneGap to access native features of the device. Gain an understanding of the different UI frameworks that are available for building mobile web apps. Learn how to include mapping and leverage location-based services in mobile web apps to create engaging mobile experiences. Enable social integration with your Android web app and gain access to millions of potential users. After reading this book, you will not only have a greater understanding of the world of web apps on Android, but also how to leverage additional tools and frameworks to increase the reach of your mobile web apps. Additionally, through the practical samples in the book you will have been given solid exposure of where both the opportunities and challenges lie when building mobile apps the web way. What you’ll learn What Android web apps can do, and when to use web development rather than native development to create an application. How to use existing JavaScript and CSS frameworks to create rich mobile user interfaces. When to use HTML5 and when to use a native bridging framework to access native Android functionality. Connext with cloud services and APIs to build engaging location based services and games. Enable social integration with your Android web app and gain access to millions of potential users. Who this book is for This book is targeted at web developers looking to transfer their skills over to mobile application development. Readers will understand that Android is continuing to gain momentum in the marketplace and will want to build an application specifically for that platform. They will have a strong desire to use web technologies rather than the native tools to build applications, either due to personal taste or to gain cross-platform mobile portability for the majority of their application code. Table of Contents Getting Started Building a Mobile HTML Entry Form HTML5 Storage APIs Constructing a Multipage App Synchronizing with the Cloud Competing with Native Apps Exploring Interactivity Location Based Services and Mobile Mapping Native Bridging with PhoneGap Integrating with Social APIs Mobile UI Frameworks Compared Polishing and Packaging an App for Release The Future of Mobile Computing Appendix: Debugging Android Web Apps",
    "authors": [
      {
        "slug": "damon-oehlman",
        "name": "Damon Oehlman"
      },
      {
        "slug": "sbastien-blanc",
        "name": "Sébastien Blanc"
      }
    ],
    "categories": [
      "javascript",
      "css"
    ]
  },
  {
    "slug": "ppk-on-javascript",
    "thumbnail": "http://books.google.com/books/content?id=oUpYRNKCjrgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "ppk on JavaScript",
    "description": "Whether you're an old-school scripter who needs to modernize your JavaScripting skills or a standards-aware Web developer who needs best practices and code examples, you'll welcome this guide from a JavaScript master. Other JavaScript books use example scripts that have little bearing on real-world Web development and are useful only in the chapter at hand. In contrast, Peter-Paul Koch's book uses eight real-world scripts he created for real-world clients in order to earn real-world money. That means the scripts are guaranteed to do something useful (and sellable!) that enhances the usability of the page they're used on. The book's example scripts include one that sorts a data table according to the user's search queries, a form validation script, a script that shows form fields only when the user needs them, a drop-down menu, and a data retrieval script that uses simple Ajax and shows the data in an animation. After an overview of JavaScript's purpose, Peter-Paul provides theoretical chapters on the context (jobs for JavaScript, CSS vs. JavaScript), the browsers (debugging, the arcana of the browser string), and script preparation. Then follow practical chapters on Core, BOM, Events, DOM, CSS Modification, and Data Retrieval, all of which are explained through a combination of theoretical instruction and the taking apart of the relevant sections of the example scripts.",
    "authors": [
      {
        "slug": "peter-paul-koch",
        "name": "Peter-Paul Koch"
      }
    ],
    "categories": [
      "javascript",
      "css"
    ]
  },
  {
    "slug": "html5-javascript-and-jquery-24-hour-trainer",
    "thumbnail": "http://books.google.com/books/content?id=XJ-LBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "HTML5, JavaScript, and jQuery 24-Hour Trainer",
    "description": "Master web app development with hands-on practice and video demonstration HTML5, JavaScript, and jQuery 24-Hour Trainer shows you how to build real-world HTML5 apps — both web-based and mobile — in combination with JavaScript, jQuery, and CSS/CSS3. You'll learn progressively more advanced skills as you work through the series of hands-on video lessons. Exercises and screencasts walk you step-by-step through the process of building web applications, and give you the opportunity to experiment and extend the examples to create your own working web app. You'll gain a solid understanding of the fundamental technologies, and develop a skillset that fully exploits the functionality of web development tools. Although HTML5 is at the forefront of web development, it exists within an ecosystem that also includes CSS/CSS3, JavaScript, and JavaScript libraries like jQuery. Building robust, functional web applications requires a clear understanding of these technologies, and more importantly, the manner in which they fit together. This is your step-by-step guide to building web apps, with a hands-on approach that helps you learn by doing. Master the fundamentals of HTML and HTML5 Explore multimedia capabilities and CSS3 Integrate offline data storage, background processes, and other APIs Adapt web applications for mobile phones and tablets Whether you're looking for a quick refresher or a first-time lesson, HTML5, JavaScript, and jQuery 24-Hour Trainer will quickly get you up to speed.",
    "authors": [
      {
        "slug": "dane-cameron",
        "name": "Dane Cameron"
      }
    ],
    "categories": [
      "javascript",
      "css"
    ]
  },
  {
    "slug": "iphone-javascript-cookbook",
    "thumbnail": "http://books.google.com/books/content?id=3UMRoqheU3sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "IPhone JavaScript Cookbook",
    "description": "Clear and practical recipes for building web applications using JavaScript and AJAX without having to learn Objective-C or Cocoa.",
    "authors": [
      {
        "slug": "arturo-fernandez-montoro",
        "name": "Arturo Fernandez Montoro"
      }
    ],
    "categories": [
      "javascript",
      "css"
    ]
  },
  {
    "slug": "javascript-projects-for-kids",
    "thumbnail": "http://books.google.com/books/content?id=l6pGjwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "JavaScript Projects for Kids",
    "description": "Gear up for a roller-coaster ride into the world of JavaScript and programming with this easy-to-follow, fun, and entertaining project-based guideAbout This Book- Get to know the concepts of HTML and CSS to work with JavaScript- Explore the concepts of object-oriented programming- Follow this step-by-step guide on the fundamentals of JavaScript programmingWho This Book Is ForIf you've never written code before or you are completely new to the world of web programming, then this book is the right choice for you. This book is for kids of age 10 years and above and parents who are completely new to the world of programming and want to get introduced to programming.What You Will Learn- Learn how to work with Google Developer tools to iterate, debug and profile your code- Develop a Battleship game using the basic concepts of HTML and CSS- Get to know the fundamentals of JavaScript programming- Create our own version of Pac Man game.- Discover the vital concepts of object-oriented programmingIn DetailJavaScript is the most widely-used programming language for web development and that's not all! It has evolved over the years and is now being implemented in an array of environments from websites to robotics. Learning JavaScript will help you see the broader picture of web development.This book will take your imagination to new heights by teaching you how to work with JavaScript from scratch. It will introduce you to HTML and CSS to enhance the appearance of your applications. You'll then use your skills to build on a cool Battleship game! From there, the book will introduce you to jQuery and show you how you can manipulate the DOM. You'll get to play with some cool stuff using Canvas and will learn how to make use of Canvas to build a game on the lines of Pacman, only a whole lot cooler! Finally, it will show you a few tricks with OOP to make your code clean and will end with a few road maps on areas you can explore further.Style and approachThis is an easy-to-follow, informative, and fun guide that takes a project-based approach to teaching programming in JavaScript. You will learn everything you need to get started with serious web application development.",
    "authors": [
      {
        "slug": "syed-omar-faruk-towaha",
        "name": "Syed Omar Faruk Towaha"
      }
    ],
    "categories": [
      "javascript",
      "css"
    ]
  },
  {
    "slug": "foundation-website-creation-with-html5-css3-and-javascript",
    "thumbnail": "http://books.google.com/books/content?id=-m08A3lsSUgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Foundation Website Creation with HTML5, CSS3, and JavaScript",
    "description": "Foundation Website Creation with HTML5, CSS3, and JavaScript shows the entire process of building a website. This process involves much more than just technical knowledge, and this book provides all the information you'll need to understand the concepts behind designing and developing for the Web, as well as the best means to deliver professional results based on best practices. Of course, there is far more to building a successful website than knowing a little Hypertext Markup Language (HTML). The process starts long before any coding takes place, and this book introduces you to the agile development process, explaining why this method makes so much sense for web projects and how best to implement it. We also make sure you're up to date by using the latest HTML5 features. Planning is vital, so you'll also learn to use techniques such as brainstorming, wireframes, mockups, and prototypes to get your project off to the best possible start and help ensure smooth progress as it develops. An understanding of correct, semantic markup is essential for any web professional; this book explains how HTML5 should be used to structure content so that the markup adheres to current web standards. You'll learn about the wide range of HTML5 elements available to you, and you'll learn how and when to use them through building example web pages. Without creative use of Cascading Style Sheets (CSS), websites would all look largely the same. CSS enables you to set your website apart from the rest, while maintaining the integrity of your markup. We'll showcase the new features of CSS3 and how you can use them. You'll learn how CSS3 works and how to apply styles to your pages, allowing you to realize your design ideas in the browser. JavaScript can be used to make your website easier and more interesting to use. This book provides information on appropriate uses of this technology and introduces the concepts of JavaScript programming. You'll also see how JavaScript works as part of the much-hyped technique Ajax, and in turn, where Ajax fits into the wider Web 2.0 picture. While a website is being built, it needs to be tested across multiple browsers and platforms to ensure that the site works for all users, regardless of ability or disability, and this book explains how best to accomplish these tasks. Then, it discusses the process of launching and maintaining the site so that it will continue to work for all its users throughout its life cycle. Foundation Website Creation with HTML5, CSS3, and JavaScript concludes by covering server-side technologies, acting as a guide to the different options available. With insights from renowned experts such as Jason Fried of 37signals, Daniel Burka of Digg and Pownce, and Chris Messina of Citizen Agency, Foundation Website Creation with CSS, XHTML, and JavaScript provides invaluable information applicable to every web project—regardless of size, scope, or budget.",
    "authors": [
      {
        "slug": "joe-lewis",
        "name": "Joe Lewis"
      },
      {
        "slug": "jonathan-lane",
        "name": "Jonathan Lane"
      },
      {
        "slug": "meitar-moscovitz",
        "name": "Meitar Moscovitz"
      },
      {
        "slug": "tom-barker",
        "name": "Tom Barker"
      }
    ],
    "categories": [
      "javascript",
      "css"
    ]
  },
  {
    "slug": "javascript-and-ajax-for-dummies",
    "thumbnail": "http://books.google.com/books/content?id=cGUjAn1ulZEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "JavaScript and AJAX For Dummies",
    "description": "Learn to use these powerful tools together and build Web sites that work If you want to build Web pages that offer real value to your site's visitors, JavaScript and AJAX are top tools for the job. Even if you're new to Web programming, this book helps you create sites any designer will admire. With easy-to-understand steps and an emphasis on free tools, you'll be able to jump right into building a site using the same techniques as the pros. Down to basics — learn your way around JavaScript and choose an editor and test browser Manage complexity — use functions, arrays, and objects to create more sophisticated programs Page magic — discover how to control what happens on your pages, animate objects, and put pages in motion Get beautiful — Use the jQuery User Interface library to add sliders, tabbed interfaces, and custom dialogs to a site Come clean with AJAX — build AJAX requests into your programs, use jQuery, and work with AJAX data Open the book and find: How to choose a test browser How to discuss string concatenation with a straight face Tips for debugging your code How to add useful information to a dropdown list Why AJAX connections should be asynchronous The exciting possibilities of the jQuery library How to use the Aptana editor Online resources for JavaScript programmers",
    "authors": [
      {
        "slug": "andy-harris",
        "name": "Andy Harris"
      }
    ],
    "categories": [
      "javascript",
      "css"
    ]
  },
  {
    "slug": "building-hybrid-android-apps-with-java-and-javascript",
    "thumbnail": "http://books.google.com/books/content?id=feAlAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Building Hybrid Android Apps with Java and JavaScript",
    "description": "Build HTML5-based hybrid applications for Android with a mix of native Java and JavaScript components, without using third-party libraries and wrappers such as PhoneGap or Titanium. This concise, hands-on book takes you through the entire process, from setting up your development environment to deploying your product to an app store. Learn how to create apps that have access to native APIs, such as location, vibrator, sensors, and the camera, using a JavaScript/Java bridge—and choose the language that gives you better performance for each task. If you have experience with HTML5 and JavaScript, you’ll quickly discover why hybrid app development is the wave of the future. Set up a development environment with HTML, CSS, and JavaScript tools Create your first hybrid Android project, using Eclipse IDE Use the WebView control to host your hybrid application Explore hybrid application architecture, including JavaScript/Java communication Build single-page applications, using JavaScript libraries such as Backbone and Underscore Get optimization tips and useful snippets for CSS, DOM, and JavaScript Distribute your application to Google Play and the Amazon Appstore",
    "authors": [
      {
        "slug": "nizamettin-gok",
        "name": "Nizamettin Gok"
      },
      {
        "slug": "nitin-khanna",
        "name": "Nitin Khanna"
      }
    ],
    "categories": [
      "javascript",
      "css"
    ]
  },
  {
    "slug": "beginning-javascript-with-dom-scripting-and-ajax",
    "thumbnail": "http://books.google.com/books/content?id=dY7KiAH6tbQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Beginning JavaScript with DOM Scripting and Ajax",
    "description": "Beginning JavaScript with DOM Scripting and Ajax is an essential resource for modern JavaScript programming. This completely updated second edition covers everything you need to know to get up-to-speed with JavaScript development and add dynamic enhancements to web pages, right from the basics. As well as focusing on client-side JavaScript, you will also learn how to work with the Browser Object Model, the Document Object Model (DOM), how to use XML and JSON as well as communicate with service side scripts such as PHP. Find out how to: Construct good JavaScript syntax following modern coding practices Use JavaScript to communicate with the server and retrieve data Dynamically manipulate markup, validate forms and deal with images Debug applications using features inside the browser JavaScript is one of the most important technologies on the web. It provides the means to add dynamic functionality to your web pages and serves as the backbone of Ajax-style web development. Beginning JavaScript with DOM Scripting and Ajax will take you from being a JavaScript novice to work freely with this important technology - begin your JavaScript journey today! What you’ll learn What functions, variables, events and objects are and how to use them. How build a site that will still work in the case that JavaScript is turned off. How to access and update part of the page using code. How to use JavaScript to communicate with the server and retrieve data. How to use JavaScript to for form validation and user feedback. How to use Third-Party Libraries like jQuery. Who this book is for Beginning JavaScript with DOM Scripting and Ajax is for the person who has a good grasp of HTML and CSS but wants to add JavaScript to their skillset. If you want to learn some basic programming concepts, have experience but need help updating your skills, or you’re coming from another language, Beginning JavaScript with DOM Scripting and Ajax can help. Table of Contents Getting Started with JavaScript Data and Decisions From DHTML to DOM Scripting HTML5 and JavaScript Presentation and Behavior (CSS and Event Handling) Common Uses of JavaScript: Image and Windows JavaScript and User Integration: Navigation and Forms Back-End Interaction with Ajax and Node.js Data Validation Techniques Modern JavaScript Case Study: A Dynamic Gallery Using Third-Party JavaScript Appendix A: Debugging JavaScript",
    "authors": [
      {
        "slug": "russ-ferguson",
        "name": "Russ Ferguson"
      },
      {
        "slug": "christian-heilmann",
        "name": "Christian Heilmann"
      }
    ],
    "categories": [
      "javascript",
      "css"
    ]
  },
  {
    "slug": "mastering-css3",
    "thumbnail": "http://books.google.com/books/content?id=6hsEV6gHQIAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Mastering CSS3",
    "description": "",
    "authors": [
      {
        "slug": "smashing-magazine",
        "name": "Smashing Magazine"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "accessible-xhtml-and-css-web-sites",
    "thumbnail": "http://books.google.com/books/content?id=qEh1e-m0mqUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Accessible XHTML and CSS Web Sites",
    "description": "Shows Web developers how to make the transition from HTML to XHTML, an XML-based reformulation of HTML that offers greater design flexibility Demonstrates how to work with CSS (Cascading Style Sheets)-now supported by ninety percent of browsers and integral to new site-building tools from Macromedia and others-and implement a consistent style throughout and entire site Explains how to make a site accessible to people with impaired vision, limited hand use, dyslexia, and other issues-now a legal requirement for many sites in the U.S. and the U.K.",
    "authors": [
      {
        "slug": "jon-duckett",
        "name": "Jon Duckett"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "html-css-and-dhtml-frequently-asked-questions",
    "thumbnail": "http://books.google.com/books/content?id=7B8-PQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "HTML, CSS, And DHTML Frequently Asked Questions",
    "description": "Book Description: The Ultimate Reference & Learning Guide to HTML, DHTML, and CSS Extensive and in-depth coverage of common questions, answers, and explanations In order to stay current and competitive in today's market, web programmers must have a comprehensive understanding of HTML, DHTML, and CSS. Use this book to guide you through your learning process. From helping you to asses your skills, to preparing for an interview, to merely brushing up on old skills, Web Programming Interview Questions: HTML, DHTML, CSS FAQ will help you understand what you really need to know. Each section includes everything you need to know in an easy-to-understand format for the advanced web programmer. Key topics include: . Debugging DHTML . The creation of dynamic web pages . Structural, presentational, and hypertext markups . Stylization and design . Security and maintenance",
    "authors": [
      {
        "slug": "terry-sanchez-clark",
        "name": "Terry Sanchez-Clark"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "causes-for-the-deterioration-of-the-performance-of-candidates-in-the-css-examination",
    "thumbnail": "http://books.google.com/books/content?id=Aj05AQAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Causes for the deterioration of the performance of candidates in the C.S.S. examination",
    "description": "",
    "authors": [
      {
        "slug": "pakistan-central-public-service-commission",
        "name": "Pakistan. Central Public Service Commission"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "css-in-easy-steps",
    "thumbnail": "http://books.google.com/books/content?id=tqq9JgAMtaAC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "CSS in Easy Steps",
    "description": "Updated to include coverage of Web 2.0 components, an accessible and authoritative guide to enhancing websites using cascading style sheets provides a brief history of web design before explaining how style sheets determine the presentation of HTML documents, providing examples designed to control the appearance of text, content boxes, tables, and other page elements. Original.",
    "authors": [
      {
        "slug": "mike-mcgrath",
        "name": "Mike McGrath"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "ancestors-and-relatives-of-arthur-css-winfrey",
    "thumbnail": "http://books.google.com/books/content?id=059bAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Ancestors and relatives of Arthur C.S.S. Winfrey",
    "description": "",
    "authors": [
      {
        "slug": "arthur-c-s-s-winfrey",
        "name": "Arthur C. S. S. Winfrey"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "the-css-anthology",
    "thumbnail": "http://books.google.com/books/content?id=tHG1Y0J_9J0C&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "The CSS Anthology",
    "description": "",
    "authors": [],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "dhtml-and-css-advanced",
    "thumbnail": "http://books.google.com/books/content?id=e6VVAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "DHTML and CSS Advanced",
    "description": "• • Picks up where DHTML and CSS Visual QuickStart Guide leaves off, allowing advanced designers to create ever more ambitious sites! • Author is a seasoned Web designer, having created sites for Coca-Cola, CNN, Bell South, DuPont, and more. ��� Up-to-date volume covers the latest developments in DHTML and CSS Web design – accessible sites, migrating from table-based layouts, and more!",
    "authors": [
      {
        "slug": "jason-cranford-teague",
        "name": "Jason Cranford Teague"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "the-captain-and-submarine-css-h-l-hunley",
    "thumbnail": "http://books.google.com/books/content?id=THMVAQAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "The Captain and submarine CSS H. L. Hunley",
    "description": "",
    "authors": [
      {
        "slug": "ruth-henley-duncan",
        "name": "Ruth Henley Duncan"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "the-ordinary-gunboats-the-css-chicora-the-css-palmetto-state-and-the-battle-off-charleston-harbor-january-31-1863",
    "thumbnail": "http://books.google.com/books/content?id=_zJu1h1yTfIC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "\"The Ordinary Gunboats\": The CSS Chicora, the CSS Palmetto State, and the Battle Off Charleston Harbor, January 31, 1863",
    "description": "The Chicora and Palmetto State, two Confederate ironclad gunboats, were built to help defend Charleston Harbor from a Union naval assault. This paper is the first effort to examine the construction of these vessels in Charleston during the spring and summer of 1862. It is based on a multitude of primary sources generated at the state and local level. The arrival of General Pierre G. T. Beauregard in September 1862 as the commander of the Department of South Carolina, Georgia, and East Florida dictated a change in strategy. The general favored the construction of torpedo boats, designed by Army Captain Francis Lee, over additional ironclad gunboats. Lee's design served as part of a naval revolution utilizing torpedoes as a primary weapon. However, Lee's efforts to construct his torpedo boat in late 1862 and early 1863 were undermined by a lack of resources and the Confederate Navy's stubborn insistence on building a third gunboat. The battle off Charleston Harbor, on January 31, 1863, was an important tactical victory for the Confederate Navy. Yet, the battle also demonstrated the limitations of the Chicora and Palmetto State as offensive weapons, and justified Beauregard's initial decision to invest resources into torpedo boats.",
    "authors": [
      {
        "slug": "charles-james-wexler",
        "name": "Charles James Wexler"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "css-for-babies",
    "thumbnail": "http://books.google.com/books/content?id=Afj0ygAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "CSS for Babies",
    "description": "It's never too early to be standards compliant! Show your little ones how to display HTML elements properly with CSS (Cascading Style Sheets) and familiarize them with the visual patterns and symbols that make up the essential building blocks of the Web. CSS for Babies is the second in a three-volume set, originally designed by a NYC Web Designer for his baby. This beautiful book is a fun and colorful introduction to the ABC's of the web.",
    "authors": [
      {
        "slug": "john-c-vanden-heuvel",
        "name": "John C. Vanden-Heuvel"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "html-and-css-the-complete-reference-fifth-edition",
    "thumbnail": "http://books.google.com/books/content?id=Z1QJvbMNbyAC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "HTML and CSS: the Complete Reference, Fifth Edition",
    "description": "",
    "authors": [
      {
        "slug": "powell",
        "name": "Powell"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "coding-html-and-css",
    "thumbnail": "http://books.google.com/books/content?id=WoaxoQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Coding HTML and CSS",
    "description": "Coding HTML and CSS is a great practical guide to the basics of HTML and CSS coding. It will help with starting small and medium projects, such as customising your blog or making your own website, and give practical examples of techniques that will aid you. Additionally you will be taken through the steps of adding images and video to your website, along with a troubleshooting guide for any problems that crop up and step-by-step guides to make coding easy.",
    "authors": [
      {
        "slug": "frederic-johnson",
        "name": "Frederic Johnson"
      },
      {
        "slug": "james-wallace",
        "name": "James Wallace"
      },
      {
        "slug": "adam-crute",
        "name": "Adam Crute"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "flexible-boxes-in-css",
    "thumbnail": "http://books.google.com/books/content?id=0brlsgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Flexible Boxes in CSS",
    "description": "Layout designers rejoice: CSS finally has an update that will make your lives easier. Flexible box layout, often called Flexbox, frees you from the challenges of creating layouts with floats and padding? and lets you specify containers and their contents instead. The new model means you can specify the directions in which material flows, how content wraps, and the ways components can expand to fill a space. Whether you've been creating large sites or small, fixed sites or responsive sites, flexbox will simplify your work.",
    "authors": [
      {
        "slug": "estelle-weyl",
        "name": "Estelle Weyl"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "instant-less-css-preprocessor-how-to",
    "thumbnail": "http://books.google.com/books/content?id=mD2RipDgLQcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Instant LESS CSS Preprocessor How-to",
    "description": "Filled with practical, step-by-step instructions and clear explanations for the most important and useful tasks. Get the job done and learn as you go. A how-To book with practical recipes accompanied with rich screenshots for easy comprehension.This book takes the How-to series approach to help you learn most important tasks through recipes This book is ideal for those new to using CSS Preprocessors such as LESS, and who are looking to get a good grounding in how to use LESS. It's assumed you will have some experience in using HTML and CSS already; it is likely you will be responsible for maintaining at least one website (the larger the better), and are keen to learn how you can use LESS to help make it easier to manage your CSS styles. Although this book does incorporate some additional code using Modernizr, it is not essential to have had any previous experience with Modernizr.",
    "authors": [
      {
        "slug": "alex-libby",
        "name": "Alex Libby"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "sams-teach-yourself-html-and-css-in-24-hours-includes-new-html-5-coverage",
    "thumbnail": "http://books.google.com/books/content?id=mGSq1vR39isC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Sams Teach Yourself HTML and CSS in 24 Hours (Includes New HTML 5 Coverage)",
    "description": "In just 24 lessons of one hour or less, you can learn how to use HTML and CSS to design, create, and maintain world-class web sites. Using a clear, down-to-earth approach, each lesson builds upon the previous one, allowing even complete beginners to learn the essentials from the ground up. Full-color figures and clear step-by-step instructions help you learn quickly. Practical, hands-on examples show you how to apply what you learn. Quizzes and Exercises help you test your knowledge and stretch your skills. Learn how to… Build your own web page and get it online in an instant Format text for maximum clarity and readability Create links to other pages and to other sites Add graphics, color, and visual pizazz to your web pages Work with transparent images and background graphics Design your site’s layout and typography using CSS Get user input with web-based forms Publicize your site and make it search-engine friendly Test a web site for compatibility with different browsers Make your site easy to maintain and update as it grows Free Access to Online Learning Lab Register your book at informit.com/register for free, exclusive access to the Online Learning Lab to supplement this book’s lessons: Video walkthroughs to show you how to complete the step-by-step examples in the book Fast and fun online quizzes to test your understanding of each lesson Updates or corrections as they become available",
    "authors": [
      {
        "slug": "julie-c-meloni",
        "name": "Julie C. Meloni"
      },
      {
        "slug": "michael-morrison",
        "name": "Michael Morrison"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "beginning-web-programming-with-html-xhtml-and-css",
    "thumbnail": "http://books.google.com/books/content?id=cCYDj6vEReAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Beginning Web Programming with HTML, XHTML, and CSS",
    "description": "What is this book about? Beginning Web Programming with HTML, XHTML, and CSS teaches you how to write Web pages using HTML, XHTML, and CSS. It follows standards-based principles, but also teaches readers ways around problems they are likely to face using (X)HTML. While XHTML is the \"current\" standard, the book still covers HTML because many people do not yet understand that XHTML is the official successor to HTML, and many readers will still stick with HTML for backward compatibility and simpler/informal Web pages that don't require XHTML compliance. The book teaches basic principles of usability and accessibility along the way, to get users into the mode of developing Web pages that will be available to as many viewers as possible from the start. The book also covers the most commonly used programming/scripting language — JavaScript — and provides readers with a roadmap of other Web technologies to learn after mastering this book to add more functionality to their sites.",
    "authors": [
      {
        "slug": "jon-duckett",
        "name": "Jon Duckett"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "creating-cool-web-sites-with-html-xhtml-and-css",
    "thumbnail": "http://books.google.com/books/content?id=tj_UKm8Qa1AC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Creating Cool Web Sites with HTML, XHTML, and CSS",
    "description": "Walks readers through the process of creating a basic Web site from scratch using HMTL, the basis for billions of Web pages, and then jazzing it up with advanced techniques from the author's award-winning sites This updated edition features new material that shows readers how to attract visitors to a site and keep them there, including new JavaScript examples and coverage of cascading style sheets and XHTML, technologies that make building successful Web sites even easier Also features exciting new tips and tricks for beginning and advanced users, as well as more expanded examples and samples for users to incorporate in their own sites The book moves from basic design and deployment to advanced page layout strategies, showing how to spice up new or existing sites with sound, video, and animation",
    "authors": [
      {
        "slug": "dave-taylor",
        "name": "Dave Taylor"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "css-cookbook",
    "thumbnail": "http://books.google.com/books/content?id=dNvXnUz-pwwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "CSS Cookbook",
    "description": "Learn how to solve the real problems you face with CSS. This cookbook offers hundreds of practical examples for using CSS to format your web pages, and includes code samples you can use right away. You'll find exactly what you need, from the basics to complex hacks and workarounds. Each recipe explains how to customize a solution to meet your needs, and each chapter features a sample design that showcases the topics discussed. You'll learn about the behavior of the latest browsers-including IE 8, Firefox 3, Safari 4, and Google Chrome—and how you can resolve differences in the ways they display your web pages. Arranged in a convenient format for quick reference, this third edition is a valuable companion for anyone working with CSS. Learn the basics, such as the CSS rule structure Work with web typography and page layout Create effects for images and other page elements Learn techniques for configuring lists, forms, and tables Design effective web navigation and create custom links Get creative by combining CSS with JavaScript Learn useful troubleshooting techniques Explore features of HTML5 and CSS3",
    "authors": [
      {
        "slug": "christopher-schmitt",
        "name": "Christopher Schmitt"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "css-pocket-reference",
    "thumbnail": "http://books.google.com/books/content?id=x4rQueL7oWcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "CSS Pocket Reference",
    "description": "When you're working with CSS and need a quick answer, CSS Pocket Reference delivers. This handy, concise book provides all of the essential information you need to implement CSS on the fly. Ideal for intermediate to advanced web designers and developers, the 4th edition is revised and updated for CSS3, the latest version of the Cascading Style Sheet specification. Along with a complete alphabetical reference to CSS3 selectors and properties, you'll also find a short introduction to the key concepts of CSS. Based on Cascading Style Sheets: The Definitive Guide, this reference is an easy-to-use cheatsheet of the CSS specifications you need for any task at hand. This book helps you: Quickly find and adapt the style elements you need Learn how CSS3 features complement and extend your CSS practices Discover new value types and new CSS selectors Implement drop shadows, multiple backgrounds, rounded corners, and border images Get new information about transforms and transitions",
    "authors": [
      {
        "slug": "eric-a-meyer",
        "name": "Eric A. Meyer"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "new-perspectives-on-html-and-css-introductory",
    "thumbnail": "http://books.google.com/books/content?id=6ymRENY1Y0MC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "New Perspectives on HTML and CSS: Introductory",
    "description": "NEW PERSPECTIVES ON HTML AND CSS provides thorough instruction on building interactive Web sites from scratch. In addition to providing comprehensive coverage of HTML and CSS, this book does not require any prior knowledge on the subject and starts with the basics. Detailed explanations of key concepts and skills make even complex topics accessible to all students. New Perspectives’ signature case scenarios and case problems contextualize complex concepts. Students develop their problem solving skills by working through realistic exercises, which help them retain the material and apply what they’ve learned in a professional environment. Important Notice: Media content referenced within the product description or the product text may not be available in the ebook version.",
    "authors": [
      {
        "slug": "patrick-carey",
        "name": "Patrick Carey"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "css-the-definitive-guide",
    "thumbnail": "http://books.google.com/books/content?id=rdtCRLXAL78C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "CSS: The Definitive Guide",
    "description": "CSS: The Definitive Guide, 3rd Edition, provides you with a comprehensive guide to CSS implementation, along with a thorough review of all aspects of CSS 2.1. Updated to cover Internet Explorer 7, Microsoft's vastly improved browser, this new edition includes content on positioning, lists and generated content, table layout, user interface, paged media, and more. Simply put, Cascading Style Sheets (CSS) is a way to separate a document's structure from its presentation. The benefits of this can be quite profound: CSS allows a much richer document appearance than HTML and also saves time -- you can create or change the appearance of an entire document in just one place; and its compact file size makes web pages load quickly. CSS: The Definitive Guide, 3rd Edition, provides you with a comprehensive guide to CSS implementation, along with a thorough review of all aspects of CSS 2.1. Updated to cover Internet Explorer 7, Microsoft's vastly improved browser, this new edition includes content on positioning, lists and generated content, table layout, user interface, paged media, and more. Author Eric Meyer tackles the subject with passion, exploring in detail each individual CSS property and how it interacts with other properties. You'll not only learn how to avoid common mistakes in interpretation, you also will benefit from the depth and breadth of his experience and his clear and honest style. This is the complete sourcebook on CSS. The 3rd edition contains: Updates to reflect changes in the latest draft version of CSS 2.1 Browser notes updated to reflect changes between IE6 and IE7 Advanced selectors supported in IE7 and other major browsers included A new round of technical edits by a fresh set of editors Clarifications and corrected errata, including updated URLs ofreferenced online resources",
    "authors": [
      {
        "slug": "eric-a-meyer",
        "name": "Eric A. Meyer"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "html5-and-css-complete",
    "thumbnail": "http://books.google.com/books/content?id=vVnjLp5uji0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "HTML5 and CSS: Complete",
    "description": "Introduce your students to a new generation of Shelly Cashman Series books! For the past three decades, the Shelly Cashman Series has effectively introduced computer skills to millions of students. With HTML5 and CSS Introductory, we’re continuing our history of innovation by enhancing our proven pedagogy to reflect the learning styles of today’s students. Within this text you will find features that are specifically designed to engage students, improve retention, and prepare them for future success. Important Notice: Media content referenced within the product description or the product text may not be available in the ebook version.",
    "authors": [
      {
        "slug": "denise-woods",
        "name": "Denise Woods"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "head-first-html-and-css",
    "thumbnail": "http://books.google.com/books/content?id=BZIYQtV6yKsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Head First HTML and CSS",
    "description": "Presents information on creating Web pages using HTML and CSS.",
    "authors": [
      {
        "slug": "elisabeth-robson",
        "name": "Elisabeth Robson"
      },
      {
        "slug": "eric-freeman",
        "name": "Eric Freeman"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "advanced-css",
    "thumbnail": "http://books.google.com/books/content?id=HTtFEKPBtcsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "AdvancED CSS",
    "description": "So you think you know CSS? Take your CSS skills to the next level and learn to write organized and optimized CSS that will improve the maintainability, performance, and appearance of your work. You’ll learn how document flow and CSS positioning schemes will help you make your documents more accessible. You’ll discover the great styling possibilities of CSS paired with semantic structures like Microformats and RDFa, while enriching the self-describing semantics of XHTML content. Learn how to group logically related declarations, minify style sheets, and prevent performance bottle necks such as reflows and repaints. With support for CSS enjoying unprecedented ubiquity, you can finally use such features as generated content, complex selector chains, and CSS3’s visual properties, like box-shadow, in your projects. What you’ll learn Discover how to make use of CSS 2.1 alongside CSS3 Use CSS generated content to automatically number arbitrary elements and expose attribute metadata Learn how to use CSS for print and mobile devices, as well as for presenting XML data Uncover the techniques used to organize, manage, and apply CSS to large-scale projects Learn how to optimize your CSS for better site performance Who this book is for If you’re feeling confident with CSS, AdvancED CSS will stretch your CSS skill set even further—and you’ll do more with CSS than you thought was ever possible! Table of Contents Markup Underpins CSS CSS Fundamentals for Advanced Use CSS-Generated Content Optimizing for Print Developing for Small Screens and the Mobile Web Managing and Organizing Style Sheets Semantic Patterns for Styling Common Design Components Using a Style Sheet Library Styling XML with CSS Optimizing CSS for Performance Exploring the Emergence of CSS3 The Future of CSS and the Web",
    "authors": [
      {
        "slug": "joe-lewis",
        "name": "Joe Lewis"
      },
      {
        "slug": "meitar-moscovitz",
        "name": "Meitar Moscovitz"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "beginning-html-and-css",
    "thumbnail": "http://books.google.com/books/content?id=QwnWLMtXU7cC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Beginning HTML and CSS",
    "description": "Everything you need to build websites with the newest versions of HTML and CSS If you develop websites, you know that the goal posts keep moving, especially now that your website must work on not only traditional desktops, but also on an ever-changing range of smartphones and tablets. This step-by-step book efficiently guides you through the thicket. Teaching you the very latest best practices and techniques, this practical reference walks you through how to use HTML5 and CSS3 to develop attractive, modern websites for today's multiple devices. From handling text, forms, and video, to implementing powerful JavaScript functionality, this book covers it all. Serves as the ultimate beginners guide for anyone who wants to build websites with HTML5 and CSS3, whether as a hobbyist or aspiring professional developer Covers the basics, including the different versions of HTML and CSS and how modern websites use structure and semantics to describe their contents Explains core processes, such as marking up text, images, lists, tables, forms, audio, and video Delves into CSS3, teaching you how to control or change the way your pages look and offer tips on how to create attractive designs Explores the jQuery library and how to implement powerful JavaScript features, such as tabbed content, image carousels, and more Get up to speed on HTML5, CSS3, and today's website design with this practical guide. Then, keep it on your desk as a reference!",
    "authors": [
      {
        "slug": "rob-larsen",
        "name": "Rob Larsen"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "stylin-with-css",
    "thumbnail": "http://books.google.com/books/content?id=SAfuep1acSwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Stylin' with CSS",
    "description": "In this completely revised edition of his bestselling Stylin’ with CSS, veteran designer and programmer Charles Wyke-Smith guides you through a comprehensive overview of designing Web pages with CSS, including the advanced capabilities of CSS3 that are now widely implemented across all the major browsers. You will learn the full capabilities of the CSS language, with step-by-step examples and in-depth explanations that will take your skills to new levels, whether you are a newbie or already have experience with CSS. Stylin’ with CSS focuses on practical skills for Web designers and programmers, and blends creative design ideas with accurate technical descriptions. It will help you create robust, stylish, and flexible layouts that adjust to the constantly changing content of today’s data-driven online applications, and that display appropriately on monitors, tablets, or mobile phones. In Stylin’ with CSS, you will: See how HTML5 and CSS3 work together Develop multi-column, fixed-width, and fluid layouts Discover how the positioning and floating properties really work! Explore professional typographic techniques using downloadable fonts Style UI elements, such as drop-down menus, forms, and pop up overlays Write media queries that modify your page layouts for different screen sizes Learn about CSS3 shadows, rounded corners, gradients, and background images Create interactivity with CSS3 transforms and transitions",
    "authors": [
      {
        "slug": "charles-wyke-smith",
        "name": "Charles Wyke-Smith"
      }
    ],
    "categories": [
      "css"
    ]
  },
  {
    "slug": "gcse-design-and-technology-product-design-aqa-revision-guide",
    "thumbnail": "http://books.google.com/books/content?id=3V2cQQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "GCSE Design and Technology Product Design AQA Revision Guide",
    "description": "GCSE Design & Technology Product Design AQA Revision Guide",
    "authors": [
      {
        "slug": "richard-parsons",
        "name": "Richard Parsons"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "functional-structure-design-of-new-high-performance-materials-via-atomic-design-and-defect-engineering-adde",
    "thumbnail": "http://books.google.com/books/content?id=NVjKLIj0808C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Functional Structure Design of New High-performance Materials Via Atomic Design and Defect Engineering (ADDE)",
    "description": "",
    "authors": [
      {
        "slug": "david-rafaja",
        "name": "David Rafaja"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "design-challenge-teachers-book",
    "thumbnail": "http://books.google.com/books/content?id=xzs1kw4MuP4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Design Challenge Teacher's Book",
    "description": "A design teacher's book with advice for instructing pupil's on projects based on clearly set out recipes. The aim is to encourage children to make successful working technology.",
    "authors": [
      {
        "slug": "keith-good",
        "name": "Keith Good"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "design-research",
    "thumbnail": "http://books.google.com/books/content?id=QeTQlylyJTYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Design Research",
    "description": "Design research.",
    "authors": [
      {
        "slug": "peter-downton",
        "name": "Peter Downton"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "sketching-user-experiences-getting-the-design-right-and-the-right-design",
    "thumbnail": "http://books.google.com/books/content?id=2vfPxocmLh0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Sketching User Experiences: Getting the Design Right and the Right Design",
    "description": "Sketching User Experiences approaches design and design thinking as something distinct that needs to be better understood—by both designers and the people with whom they need to work— in order to achieve success with new products and systems. So while the focus is on design, the approach is holistic. Hence, the book speaks to designers, usability specialists, the HCI community, product managers, and business executives. There is an emphasis on balancing the back-end concern with usability and engineering excellence (getting the design right) with an up-front investment in sketching and ideation (getting the right design). Overall, the objective is to build the notion of informed design: molding emerging technology into a form that serves our society and reflects its values. Grounded in both practice and scientific research, Bill Buxton’s engaging work aims to spark the imagination while encouraging the use of new techniques, breathing new life into user experience design. Covers sketching and early prototyping design methods suitable for dynamic product capabilities: cell phones that communicate with each other and other embedded systems, \"smart\" appliances, and things you only imagine in your dreams Thorough coverage of the design sketching method which helps easily build experience prototypes—without the effort of engineering prototypes which are difficult to abandon Reaches out to a range of designers, including user interface designers, industrial designers, software engineers, usability engineers, product managers, and others Full of case studies, examples, exercises, and projects, and access to video clips that demonstrate the principles and methods",
    "authors": [
      {
        "slug": "bill-buxton",
        "name": "Bill Buxton"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "a-study-of-tunnel-design",
    "thumbnail": "http://books.google.com/books/content?id=n5kUAAAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "A Study of Tunnel Design",
    "description": "",
    "authors": [
      {
        "slug": "william-james-bromley",
        "name": "William James Bromley"
      },
      {
        "slug": "james-blake-eckerson",
        "name": "James Blake Eckerson"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "design-motifs-of-ancient-mexico",
    "thumbnail": "http://books.google.com/books/content?id=v7NO_aesJ28C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Design Motifs of Ancient Mexico",
    "description": "Symbols and designs from the Aztec, Maya, and other early cultures depict plumed serpents, demons, human heads and figures, and other striking images. 503 black-and-white illustrations.",
    "authors": [
      {
        "slug": "jorge-enciso",
        "name": "Jorge Enciso"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "strength-design-in-aluminum-commentary-on-csa-s157-05-strength-design-in-aluminum",
    "thumbnail": "http://books.google.com/books/content?id=NVjKLIj0808C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Strength Design in Aluminum ; Commentary on CSA S157-05, Strength Design in Aluminum",
    "description": "",
    "authors": [
      {
        "slug": "canadian-standards-association",
        "name": "Canadian Standards Association"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "basics-design-08-design-thinking",
    "thumbnail": "http://books.google.com/books/content?id=9klpFfZDnWgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Basics Design 08: Design Thinking",
    "description": "Design Thinking examines the ways in which solutions to a design brief can be approached, researched and refined.",
    "authors": [
      {
        "slug": "gavin-ambrose",
        "name": "Gavin Ambrose"
      },
      {
        "slug": "paul-harris",
        "name": "Paul Harris"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "design-of-electrical-machines",
    "thumbnail": "http://books.google.com/books/content?id=JLfoQFLc8s4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Design of Electrical Machines",
    "description": "",
    "authors": [
      {
        "slug": "k-g-upadhyay",
        "name": "K. G. Upadhyay"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "architectural-and-building-design",
    "thumbnail": "http://books.google.com/books/content?id=OrFNAAAAYAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Architectural and Building Design",
    "description": "",
    "authors": [
      {
        "slug": "michael-young",
        "name": "Michael Young"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "the-best-of-business-card-design-5",
    "thumbnail": "http://books.google.com/books/content?id=Nf7NfQxJJ-gC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "The Best of Business Card Design 5",
    "description": "",
    "authors": [],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "doodle-design-draw",
    "thumbnail": "http://books.google.com/books/content?id=TPTtxcrpzbsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Doodle, Design & Draw",
    "description": "Chock-full of sophisticated and trendy images, this doodle book encourages aspiring designers to experiment with color and pattern to create original fashions. More than 60 pages of clothing and accessories.",
    "authors": [
      {
        "slug": "jennie-sun",
        "name": "Jennie Sun"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "a-letter-concerning-the-art-or-science-of-design-written-from-italy-to-my-lord-signed-shaftesbury-part-of-a-larger-work",
    "thumbnail": "http://books.google.com/books/content?id=k49bAAAAQAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "A letter concerning the art, or science of design, written from Italy to my lord **** [signed Shaftesbury. Part of a larger work].",
    "description": "",
    "authors": [
      {
        "slug": "anthony-ashley-cooper-3rd-earl-of-shaftesbury",
        "name": "Anthony Ashley Cooper (3rd earl of Shaftesbury.)"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "the-chrysanthemum-in-japanese-design",
    "thumbnail": "http://books.google.com/books/content?id=eSiNJnQpozEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "The Chrysanthemum in Japanese Design",
    "description": "Imported from China during the 8th century, the chrysanthemumis the official flower of Japan. The Japanese monarchyis known as The Chrysanthemum Throne, and the exquisiteblossom is widely revered as a symbol of longevity, dignity,and nobility. This volume, reproduced from a rare andexpensive publication, features more than 120 color woodblockimages of the breathtaking perennials.Reprint of the Uchida Bijutsu Shoshi, Kyoto, 1936 edition.",
    "authors": [
      {
        "slug": "kawarasaki-koto",
        "name": "Kawarasaki Koto"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "digital-design-with-rtl-design-verilog-and-vhdl",
    "thumbnail": "http://books.google.com/books/content?id=-YayRpmjc20C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Digital Design with RTL Design, Verilog and VHDL",
    "description": "An eagerly anticipated, up-to-date guide to essential digital design fundamentals Offering a modern, updated approach to digital design, this much-needed book reviews basic design fundamentals before diving into specific details of design optimization. You begin with an examination of the low-levels of design, noting a clear distinction between design and gate-level minimization. The author then progresses to the key uses of digital design today, and how it is used to build high-performance alternatives to software. Offers a fresh, up-to-date approach to digital design, whereas most literature available is sorely outdated Progresses though low levels of design, making a clear distinction between design and gate-level minimization Addresses the various uses of digital design today Enables you to gain a clearer understanding of applying digital design to your life With this book by your side, you'll gain a better understanding of how to apply the material in the book to real-world scenarios.",
    "authors": [
      {
        "slug": "frank-vahid",
        "name": "Frank Vahid"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "design-your-own-garden",
    "thumbnail": "http://books.google.com/books/content?id=5sE5AAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Design your own garden",
    "description": "",
    "authors": [
      {
        "slug": "dawn-macleod",
        "name": "Dawn Macleod"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "analysis-as-a-basis-for-design",
    "thumbnail": "http://books.google.com/books/content?id=UUJlAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Analysis as a Basis for Design",
    "description": "",
    "authors": [
      {
        "slug": "carl-wesley-stromberg",
        "name": "Carl Wesley Stromberg"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "design-in-business",
    "thumbnail": "http://books.google.com/books/content?id=yU7U9JG8wUcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Design in Business",
    "description": "This book takes a more integrated approach to design, assuming it is a core business process as opposed to a peripheral or specialist activity. Design in Business aims for an analogous Total Design Management making design a part of everyone's concern.",
    "authors": [
      {
        "slug": "margaret-bruce",
        "name": "Margaret Bruce"
      },
      {
        "slug": "j-r-bessant",
        "name": "J. R. Bessant"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "factory-design",
    "thumbnail": "http://books.google.com/books/content?id=d72EPwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Factory Design",
    "description": "Industrial manufacturing facilities have always been an own category in architecture. Ever since the development of factories in the 17th century this type of build-ings have first of all served to improve the production process while reflecting at the same time the workflow. Furthermore plants have also the task of represent- ing the values of the company to the outside world. The volume is dedicated to the inner organization of contemporary factory design as well as to its outer appearance featuring around 60 projects from all continents.",
    "authors": [
      {
        "slug": "chris-van-uffelen",
        "name": "Chris van Uffelen"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "elements-of-design",
    "thumbnail": "http://books.google.com/books/content?id=YdFNAAAAYAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Elements of Design",
    "description": "",
    "authors": [
      {
        "slug": "william-rimmer",
        "name": "William Rimmer"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "design-of-electronic-circuits-and-computer-aided-design",
    "thumbnail": "http://books.google.com/books/content?id=NwFkDi-XPHcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Design of Electronic Circuits and Computer Aided Design",
    "description": "This Book Is In Two Parts For Better Presentation Of The Subject. It Covers Analysis And Design Of A Wide Range Of Electronic Circuits, Which Will Be Useful To A Whole Spectrum Of Readers; From Hobbyists To Professional Engineers. The Book Will Be Notably Useful For The Engineering Students For Diploma As Well As Degree Grades.The Topics Covered Are Unregulated Supplies, Zener Voltage Regulators, Transistorised Voltage Supplies, Controlled Rectifiers, Voltage Amplifiers, Power Amplifiers And Multivibrators. In Part Ii Of This Book, Emphasis Has Been Given To The Computer-Aided Design Of The Above Circuits. It Covers Network Analysis, Device Modeling And Study Of Some Of The Popular Circuits And Their Computer-Aided Design. A Clear And Precise Logistics Is Developed And Presented With Functional Programmes Which Should Help The Readers To Formulate Their Own Programme For The Oft-Repeated Design Problems.",
    "authors": [
      {
        "slug": "m-m-shah",
        "name": "M. M. Shah"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "20th-century-design",
    "thumbnail": "http://books.google.com/books/content?id=-TanrIWZSx8C&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "20th Century Design",
    "description": "This is a bluffer's guide to the design criticism and commentary of the 20th century, providing an entertaining summary of the key design texts of the last hundred years. Yet this collection goes further than simply listing the design classics: it also puts design in context and demonstrates the impact and relevance of design values on contemporary living. It is written in an accessible, provocative and entertaining style. Conway Lloyd Morgan has published books on leading 20th century designers, including Philippe Starck and Jean Nouvel and edited the 'International Design Yearbook'. This is the second in the Architectural Press series of Reader's Guides, comprised of reviews of seminal texts on design in the 20th century. *Condensed summary of the most important design books saves you research time and effort. *Cut through the abstract and be taken straight to the key points by the witty and controversial style of Morgan.",
    "authors": [
      {
        "slug": "conway-lloyd-morgan",
        "name": "Conway Lloyd Morgan"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "a-century-of-design",
    "thumbnail": "http://books.google.com/books/content?id=F6eOXcOlMF4C&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "A Century of Design",
    "description": "\"Illustrated with over 500 photographs, A Century of Design is unique in providing a designer-by designer review within a historical context, revealing the connections between designers and major design movements from around the world from Art Nouveau to Postmodernism and beyond. Each chapter explains the background and orgins of the century's most important style movements, period by period. The most influential internationally known designers of the 20th century are discussed, their major works are featured and their sources of inspiration outlined. A Century of Design covers everything from telephones to textiles, cutlery to computers.\"--BOOK JACKET.",
    "authors": [
      {
        "slug": "penny-sparke",
        "name": "Penny Sparke"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "neural-network-design",
    "thumbnail": "http://books.google.com/books/content?id=NVjKLIj0808C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Neural Network Design",
    "description": "This book provides a clear and detailed survey of basic neural network architectures and learning rules. In it, the authors emphasize mathematical analysis of networks, methods for training networks, and application of networks to practical engineering problems in pattern recognition, signal processing, and control systems.",
    "authors": [
      {
        "slug": "martin-t-hagan",
        "name": "Martin T. Hagan"
      },
      {
        "slug": "howard-b-demuth",
        "name": "Howard B. Demuth"
      },
      {
        "slug": "mark-h-beale",
        "name": "Mark H. Beale"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "curriculum-design",
    "thumbnail": "http://books.google.com/books/content?id=jV4OAAAAQAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Curriculum Design",
    "description": "",
    "authors": [
      {
        "slug": "michael-golby",
        "name": "Michael Golby"
      },
      {
        "slug": "jane-greenwald",
        "name": "Jane Greenwald"
      },
      {
        "slug": "ruth-west",
        "name": "Ruth West"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "design-japan",
    "thumbnail": "http://books.google.com/books/content?id=yMCDM8ZHAdkC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Design Japan",
    "description": "From acclaimed photographer Michael Freeman and design expert Michiko Rico Nosé come a unique vision of contemporary Japanese style. Following the themes of \"Work,\" \"Rest,\" and \"Play,\" they examine a wide variety of aesthetically influential spaces, objects, and personalities, and delve into the heart of fashionable Japan. Covering the work of 27 designers, architects, artists, and creative entrepreneurs, this eye-opening look takes readers right into the very homes and offices of these trendsetters. From movable gardens to the perfect kitchen, from boutiques and beauty salons to the hippest clubs, bars, and restaurants, the specially commissioned photographs capture Japanese design at its playful, innovative best.",
    "authors": [],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "guidelines-for-seismic-evaluation-and-design-of-petrochemical-facilities",
    "thumbnail": "http://books.google.com/books/content?id=MQxGrcOqchkC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Guidelines for Seismic Evaluation and Design of Petrochemical Facilities",
    "description": "Prepared by the Task Committee on Seismic Evaluation and Design of the Petrochemical Committee of the Energy Division of ASCE. This report offers practical recommendations regarding the design and safety of petrochemical facilities during and following an earthquake. For new facilities, the recommendations focus on interpreting of the intent of building codes as applied to petrochemical facilities; the report also gives practical guidance on design details and considerations that are not included in building codes. For existing facilities, the guidelines offerØevaluation methodologies that rely heavily on experience from past earthquakes, coupled with focused analyses.Ø These guidelines will be valuable to structural design engineers, local building authorities, and operating personnel responsible for establishing seismic design and construction standards.",
    "authors": [
      {
        "slug": "task-committee-on-seismic-evaluation-and-design-of-petrochemical-facilities",
        "name": "Task Committee on Seismic Evaluation and Design of Petrochemical Facilities"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "airplane-design-preliminary-configuration-design-and-integration-of-the-propulsion-system",
    "thumbnail": "http://books.google.com/books/content?id=bJlZ4mKf1EkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Airplane Design: Preliminary configuration design and integration of the propulsion system",
    "description": "",
    "authors": [
      {
        "slug": "jan-roskam",
        "name": "Jan Roskam"
      }
    ],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "design-for-rcc-slabs-a-ready-reckoner",
    "thumbnail": "http://books.google.com/books/content?id=fu13rXeLfgkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Design for RCC Slabs - A Ready Reckoner",
    "description": "",
    "authors": [],
    "categories": [
      "design"
    ]
  },
  {
    "slug": "design-and-performance-analysis-of-electric-vehicles-fed-by-multiple-fuel-cells",
    "thumbnail": "http://books.google.com/books/content?id=Yw91eqhkpr8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Design and Performance Analysis of Electric Vehicles Fed by Multiple Fuel Cells",
    "description": "Recent advances in fuel cell developments have introduced them to many applications such as hybrid electric vehicles and heat/power cogenerations. They bring the advantage of clean energy and decrease the dependency on imported oil by providing fuel efficient devices in many applications such as electric vehicles. Conventional designs of hybrid fuel cell vehicles make use of a single fuel cell power source and a storage device to provide the base load and transients in various driving cycles. This thesis proposes a new configuration of multiple fuel cell power sources in hybrid fuel cell vehicles. Fuel cells are downsized in this new configuration to provide the same amount of power, which brings the advantage of a highly fuel economic design. The power control algorithm for this new configuration is presented and simulation results are studied for a case of double fuel cell power sources. Efficiency analysis for this new configuration is presented and compared with the conventional configuration. The main objective of this thesis is to achieve a higher efficiency in urban driving cycle. In conventional configurations, the fuel cell is not efficiently loaded in urban driving cycles, where small powers were required from the single fuel cell power source. Reliability analysis is also presented for this configuration.",
    "authors": [],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "computer-aided-design-of-user-interfaces-v",
    "thumbnail": "http://books.google.com/books/content?id=-HWXLcWHx04C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Computer-Aided Design of User Interfaces V",
    "description": "This book gathers the latest experience of experts, research teams and leading organizations involved in computer-aided design of user interfaces of interactive applications. This area investigates how it is desirable and possible to support, to facilitate and to speed up the development life cycle of any interactive system. In particular, it stresses how the design activity could be better understood for different types of advanced interactive systems.",
    "authors": [
      {
        "slug": "galle-calvary",
        "name": "Gaëlle Calvary"
      },
      {
        "slug": "costin-pribeanu",
        "name": "Costin Pribeanu"
      },
      {
        "slug": "giuseppe-santucci",
        "name": "Giuseppe Santucci"
      },
      {
        "slug": "jean-vanderdonckt",
        "name": "Jean Vanderdonckt"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "material-design-implementation-with-angularjs",
    "thumbnail": "http://books.google.com/books/content?id=3gvpDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Material Design implementation with AngularJS",
    "description": "This book is about building high-quality web and mobile user interfaces (UI) that are interactive, fluid, and provide a consistent experience across devices from desktops to tablets to smartphones. Use a Material Design approach to position elements and create animations along with principles of the sophisticated AngularJS JavaScript framework. Take advantage of Angular Material, a UI component framework that works out of the box to design web pages that adapt to various screen sizes and adhere to Material Design specifications. This book teaches you how to: Develop a UI that adheres to Material Design principles using Angular Material, a UI component framework Use various Angular Material elements, directives, and services in conjunction with CSS3 Flexbox for layout management Use best practice design techniques to develop a responsive UI to fit multiple devices and screen sizes from desktop to tablet to mobile phone Develop web apps for both mobile and desktop form factors and screen sizes using HTML, CSS, and JavaScript",
    "authors": [
      {
        "slug": "v-keerti-kotaru",
        "name": "V. Keerti Kotaru"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "design-and-cost-of-feedlot-runoff-control-facilities",
    "thumbnail": "http://books.google.com/books/content?id=YUZAkt2KknAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Design and cost of feedlot runoff control facilities",
    "description": "",
    "authors": [
      {
        "slug": "j-ronald-miner",
        "name": "J. Ronald Miner"
      },
      {
        "slug": "robert-b-wensink",
        "name": "Robert B. Wensink"
      },
      {
        "slug": "robert-m-mcdowell",
        "name": "Robert M. McDowell"
      },
      {
        "slug": "robert-s-kerr-environmental-research-laboratory",
        "name": "Robert S. Kerr Environmental Research Laboratory"
      },
      {
        "slug": "oregon-state-university-dept-of-agricultural-engineering",
        "name": "Oregon State University. Dept. of Agricultural Engineering"
      },
      {
        "slug": "oregon-state-university-corvallis-dept-of-agricultural-engineering",
        "name": "Oregon. State University, Corvallis. Dept. of Agricultural Engineering"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "advanced-rf-microwave-circuit-design",
    "thumbnail": "http://books.google.com/books/content?id=H4d9EByWXsQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Advanced RF & Microwave Circuit Design",
    "description": "RF and Microwaves is currently in the forefront as a fundamental technology in numerous industrial and commercial applications. As applications of RF and microwaves continue to evolve and as this technology becomes a common factor in the scientific and engineering communities it is imperative that university students and practicing scientists and engineers become thoroughly familiar with the measurement principles, electronics, and design fundamentals underlying this technology. RF and Microwaves is currently in the forefront as a fundamental technology in numerous industrial and commercial applications. As applications of RF and microwaves continue to evolve and as this technology becomes a common factor in the scientific and engineering communities it is imperative that university students and practicing scientists and engineers become thoroughly familiar with the measurement principles, electronics, and design fundamentals underlying this technology. Advanced RF & Microwave Circuit Design is the quickest way to master this powerful subject, and information contained within the pages of this book will make every key electronic, measurement, and design principle you need a simple task. The book introduces concepts on a wide range of materials and has several advantages over existing texts, including: 1. The presentation of a series of scientific postulates and axioms, which lays the foundation for any of the engineering sciences and is unique to this book compared with similar RF and Microwave texts. 2. The presentation of classical laws and principles of electricity and magnetism, all inter-related, conceptually and graphically. 3. There is a shift of emphasis from rigorousmathematical solutions of Maxwell's equations, and instead has been aptly placed on simple yet fundamental concepts that underlie these equations. This shift of emphasis will promote a deeper understanding of the electronics, particularly at RF/Microwave frequencies. 4. Fundamentals of electronics have been amply treated, which makes an easy transition to RF/Microwave principles and prevents a gap of knowledge in the reader's mind.",
    "authors": [
      {
        "slug": "matthew-m-radmanesh",
        "name": "Matthew M. Radmanesh"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "html5-and-css3-responsive-web-design-cookbook",
    "thumbnail": "http://books.google.com/books/content?id=WyKZuGDelEUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Html5 and Css3 Responsive Web Design Cookbook",
    "description": "As a Cookbook, we are targeting existing developers who need to pick and choose specific recipes in order to help their websites become accessible (and usable) regardless of screen size, device, or browser.HTML5 and CSS3 Responsive Web Design Cookbook, for all of today's wireless Internet devices, is for web developers seeking innovative techniques that deliver fast, intuitive interfacing for the latest mobile Internet devices.",
    "authors": [
      {
        "slug": "benjamin-lagrone",
        "name": "Benjamin LaGrone"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "interactive-systems-design-specification-and-verification",
    "thumbnail": "http://books.google.com/books/content?id=51Qyi0Sk1E0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Interactive Systems. Design Specification, and Verification",
    "description": "This book constitutes the refereed post-proceedings of the 12th International Workshop on Design, Specification, and Verification of Interactive Systems, DSV-IS 2005. The 20 revised full papers, 1 keynote paper, and 4 summaries of group discussions are organized in topical sections on teams and groups, sketches and templates, away from the desktop, migration and mobility, analysis tools, model-based design processes and tools, and group discussions.",
    "authors": [
      {
        "slug": "stephen-w-gilroy",
        "name": "Stephen W. Gilroy"
      },
      {
        "slug": "michael-d-harrison",
        "name": "Michael D. Harrison"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "practitioners-handbook-for-user-interface-design-and-development",
    "thumbnail": "http://books.google.com/books/content?id=Q95QAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Practitioner's Handbook for User Interface Design and Development",
    "description": "Using extensive practical examples, the Practitioner's Handbook for User Interface Design and Development illuminates today's best practices for user interface design, usability, and user-centered development. Robert J. Torres introduces user interfaces from three points of view: the user, the developer, and the system. Next, he introduces a complete user-centered UI development process, beginning at the highest level and then drilling down to each phase of the lifecycle. For every stage, Torres offers clear principles, specific guidelines, and practical heuristics for self-assessment.",
    "authors": [
      {
        "slug": "robert-j-torres",
        "name": "Robert J. Torres"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "toll-plaza-design",
    "thumbnail": "http://books.google.com/books/content?id=Upbj8rDAz4kC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Toll Plaza Design",
    "description": "",
    "authors": [
      {
        "slug": "albert-e-schaufler",
        "name": "Albert E. Schaufler"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "the-compiler-design-handbook",
    "thumbnail": "http://books.google.com/books/content?id=1kqAv-uDEPEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "The Compiler Design Handbook",
    "description": "Today’s embedded devices and sensor networks are becoming more and more sophisticated, requiring more efficient and highly flexible compilers. Engineers are discovering that many of the compilers in use today are ill-suited to meet the demands of more advanced computer architectures. Updated to include the latest techniques, The Compiler Design Handbook, Second Edition offers a unique opportunity for designers and researchers to update their knowledge, refine their skills, and prepare for emerging innovations. The completely revised handbook includes 14 new chapters addressing topics such as worst case execution time estimation, garbage collection, and energy aware compilation. The editors take special care to consider the growing proliferation of embedded devices, as well as the need for efficient techniques to debug faulty code. New contributors provide additional insight to chapters on register allocation, software pipelining, instruction scheduling, and type systems. Written by top researchers and designers from around the world, The Compiler Design Handbook, Second Edition gives designers the opportunity to incorporate and develop innovative techniques for optimization and code generation.",
    "authors": [
      {
        "slug": "yn-srikant",
        "name": "Y.N. Srikant"
      },
      {
        "slug": "priti-shankar",
        "name": "Priti Shankar"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "advanced-systems-design-with-java-uml-and-mda",
    "thumbnail": "http://books.google.com/books/content?id=oxp_TYOMGCsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Advanced Systems Design with Java, UML and MDA",
    "description": "The Model Driven Architecture defines an approach where the specification of the functionality of a system can be separated from its implementation on a particular technology platform. The idea being that the architecture will be able to easily be adapted for different situations, whether they be legacy systems, different languages or yet to be invented platforms. MDA is therefore, a significant evolution of the object-oriented approach to system development. Advanced System Design with Java, UML and MDA describes the factors involved in designing and constructing large systems, illustrating the design process through a series of examples, including a Scrabble player, a jukebox using web streaming, a security system, and others. The book first considers the challenges of software design, before introducing the Unified Modelling Language and Object Constraint Language. The book then moves on to discuss systems design as a whole, covering internet systems design, web services, Flash, XML, XSLT, SOAP, Servlets, Javascript and JSP. In the final section of the book, the concepts and terminology of the Model Driven Architecture are discussed. To get the most from this book, readers will need introductory knowledge of software engineering, programming in Java and basic knowledge of HTML. * Examines issues raised by the Model-Driven Architecture approach to development * Uses easy to grasp case studies to illustrate complex concepts * Focused on the internet applications and technologies that are essential for students in the online age",
    "authors": [
      {
        "slug": "kevin-lano",
        "name": "Kevin Lano"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "architectural-commercial-design-using-autodesk-revit-2014",
    "thumbnail": "http://books.google.com/books/content?id=fGGWWWKQsEYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Architectural Commercial Design Using Autodesk Revit 2014",
    "description": "Architectural Commercial Design Using Revit 2014 is designed for the architectural student using Revit 2014. The intent is to provide the student with a well-rounded knowledge of tools and techniques for use in both school and industry. This text takes a project based approach to learning Revit's Architectural tools in which the student develops a three story office building. Each book comes with a CD containing numerous video presentations of the written material. General building codes and industry standard conventions are covered in a way that is applicable to the current exercise. The first two chapters are intended to get the reader familiar with the user interface and many of the common menus and tools of Revit 2014. A small office is created in chapter two to show just how easy it is to get started using Revit. By the end of chapter two the student will be excited and prepared to take on a much larger project. Throughout the rest of the book the student develops a three story office building. The drawings start with the floor plans and develop all the way to photo-realistic renderings like the one on the cover of this book. In these chapters many of the architectural tools and features of Revit 2014 are covered in greater detail.",
    "authors": [
      {
        "slug": "daniel-john-stine",
        "name": "Daniel John Stine"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "interior-design-using-autodesk-revit-2014",
    "thumbnail": "http://books.google.com/books/content?id=6by0w0aeauMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Interior Design Using Autodesk Revit 2014",
    "description": "The intent of this book is to provide the interior design student a well-rounded knowledge of Autodesk Revit tools and techniques. These skills can then be applied to enhance professional development in both academia and industry. The overall premise of the book is to learn Revit while developing the interior of a two story law office. The reader is provided an architectural model with established columns, beams, exterior walls, minimal interior walls and roofs in which to work. This allows more emphasis to be placed on interior design rather than primary architectural elements. The chapters chronology generally follows the typical design process. Students will find this book helps them more accurately and efficiently develop their design ideas and skills. The first chapter introduces the reader to Revit, Building Information Modeling (BIM) and the basics of opening, saving and creating a new project. The second provides a quick introduction to modeling basic elements in Revit including walls, doors, windows and more. This chapter is designed to show students how powerful Revit is and hopefully make them more excited about learning it. The remainder of the book is spent developing the interior space of the law office with an established space program. A student will learn how to view and navigate within the provided 3D architectural model, managing and creating materials and develop spaces with walls, doors and windows. Once all the spaces are added to the model, several areas are explored and used as the basis to cover Revit commands and workflows. At the end of this tutorial, the reader will be able to model floor finishes, ceilings with soffits, casework, custom reception desk, restrooms, furniture and light fixtures. Additional features such as tags, schedules and photo-realistic rendering will be covered.",
    "authors": [
      {
        "slug": "daniel-john-stine",
        "name": "Daniel John Stine"
      },
      {
        "slug": "aaron-r-hansen",
        "name": "Aaron R. Hansen"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "advances-in-affective-and-pleasurable-design",
    "thumbnail": "http://books.google.com/books/content?id=mY9YBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Advances in Affective and Pleasurable Design",
    "description": "This volume discusses pleasurable design — a part of the traditional usability design and evaluation methodologies. The book emphasizes the importance of designing products and services to maximize user satisfaction. By combining this with traditional usability methods it increases the appeal of products and use of services. This book focuses on a positive emotional approach in product, service, and system design and emphasizes aesthetics and enjoyment in user experience and provides dissemination and exchange of scientific information on the theoretical and practical areas of affective and pleasurable design for research experts and industry practitioners from multidisciplinary backgrounds, including industrial designers, emotion designer, ethnographers, human-computer interaction researchers, human factors engineers, interaction designers, mobile product designers, and vehicle system designers.",
    "authors": [
      {
        "slug": "yong-gu-ji",
        "name": "Yong Gu Ji"
      },
      {
        "slug": "sooshin-choi",
        "name": "Sooshin Choi  "
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "the-value-of-metaphors-in-conceptual-user-interface-design",
    "thumbnail": "http://books.google.com/books/content?id=4cHaAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "The Value of Metaphors in Conceptual User-interface Design",
    "description": "",
    "authors": [
      {
        "slug": "andrew-d-cohen",
        "name": "Andrew D. Cohen"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "the-essential-guide-to-user-interface-design",
    "thumbnail": "http://books.google.com/books/content?id=Q3Xp_Awu49sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "The Essential Guide to User Interface Design",
    "description": "Bringing together the results of more than 300 new design studies, an understanding of people, knowledge of hardware and software capabilities, and the author’s practical experience gained from 45 years of work with display-based systems, this book addresses interface and screen design from the user’s perspective. You will learn how to create an effective design methodology, design and organize screens and Web pages that encourage efficient comprehension and execution, and create screen icons and graphics that make displays easier and more comfortable to use.",
    "authors": [
      {
        "slug": "wilbert-o-galitz",
        "name": "Wilbert O. Galitz"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "strategies-to-reduce-friction-losses-and-their-implications-for-the-energy-efficient-design-of-internal-flow-domains",
    "thumbnail": "http://books.google.com/books/content?id=JEqeBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Strategies to reduce friction losses and their implications for the energy efficient design of internal flow domains",
    "description": "",
    "authors": [
      {
        "slug": "daschiel-gertraud-maria",
        "name": "Daschiel, Gertraud Maria"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "rapid-contextual-design",
    "thumbnail": "http://books.google.com/books/content?id=VjO6n9stHzUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Rapid Contextual Design",
    "description": "Is it impossible to schedule enough time to include users in your design process? Is it difficult to incorporate elaborate user-centered design techniques into your own standard design practices? Do the resources needed seem overwhelming? This handbook introduces Rapid CD, a fast-paced, adaptive form of Contextual Design. Rapid CD is a hands-on guide for anyone who needs practical guidance on how to use the Contextual Design process and adapt it to tactical projects with tight timelines and resources. Rapid Contextual Design provides detailed suggestions on structuring the project and customer interviews, conducting interviews, and running interpretation sessions. The handbook walks you step-by-step through organizing the data so you can see your key issues, along with visioning new solutions, storyboarding to work out the details, and paper prototype interviewing to iterate the design all with as little as a two-person team with only a few weeks to spare! *Includes real project examples with actual customer data that illustrate how a CD project actually works. *Covers the entire scope of a project, from deciding on the number and type of interviews, to interview set up and analyzing collected data. Sample project schedules are also included for a variety of different types of projects. *Provides examples of how-to write affinity notes and affinity labels, build an affinity diagram, and step-by-step instructions for consolidating sequence models. *Shows how to use consolidated data to define a design within tight time frames with examples of visions, storyboards, and paper prototypes. *Introduces CDToolsâ„¢, the first application designed to support customer-centered design.",
    "authors": [
      {
        "slug": "karen-holtzblatt",
        "name": "Karen Holtzblatt"
      },
      {
        "slug": "jessamyn-burns-wendell",
        "name": "Jessamyn Burns Wendell"
      },
      {
        "slug": "shelley-wood",
        "name": "Shelley Wood"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "elemental-design-patterns",
    "thumbnail": "http://books.google.com/books/content?id=OaG9IsCIkkcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Elemental Design Patterns",
    "description": "2012 Jolt Award Finalist! Even experienced software professionals find it difficult to apply patterns in ways that deliver substantial value to their organizations. In Elemental Design Patterns, Jason McC. Smith addresses this problem head-on, helping developers harness the true power of patterns, map them to real software implementations more cleanly and directly, and achieve far better results. Part tutorial, part example-rich cookbook, this resource will help developers, designers, architects, and analysts successfully use patterns with a wide variety of languages, environments, and problem domains. Every bit as important, it will give them a deeper appreciation for the work they’ve chosen to pursue. Smith presents the crucial missing link that patterns practitioners have needed: a foundational collection of simple core patterns that are broken down to their core elements. If you work in software, you may already be using some of these elemental design patterns every day. Presenting them in a comprehensive methodology for the first time, Smith names them, describes them, explains their importance, helps you compare and choose among them, and offers a framework for using them together. He also introduces an innovative Pattern Instance Notation diagramming system that makes it easier to work with patterns at many levels of granularity, regardless of your goals or role. If you’re new to patterns, this example-rich approach will help you master them piece by piece, logically and intuitively. If you’re an experienced patterns practitioner, Smith follows the Gang of Four format you’re already familiar with, explains how his elemental patterns can be composed into conventional design patterns, and introduces highly productive new ways to apply ideas you’ve already encountered. No matter what your level of experience, this infinitely practical book will help you transform abstract patterns into high-value solutions.",
    "authors": [
      {
        "slug": "jason-mcc-smith",
        "name": "Jason McC. Smith"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "zbrush-creature-design",
    "thumbnail": "http://books.google.com/books/content?id=NBItaI_r2eoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "ZBrush Creature Design",
    "description": "Zero in on the most cutting-edge trend in creature design for film and games: ZBrush! ZBrush allows you to develop a creature for film and games in realistic, 3D format. With this book, you will learn how to create a unique creature from start to finish and search for and repair any foreseeable problems. Clear instructions guide you through using Photoshop in combination with ZBrush to finely render a creature so you can see how it will appear on screen. Experienced ZBrush author and designer Scott Spencer shows you how to start with your concept in ZBrush as a preliminary digital model and then further refine it in Photoshop in order to fabricate a hyperrealistic image. Guides you through artistic concepts to visualize your creature Walks you through the process of conceptualizing a creature in ZBrush Details techniques for using Photoshop to refine your design Encourages you to use ZBrush as a sculpting and designing tool and then use Photoshop as a painting and finishing tool ZBrush Creature Design helps you bring your creature concepts to life.",
    "authors": [
      {
        "slug": "scott-spencer",
        "name": "Scott Spencer"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "introduction-to-optimum-design",
    "thumbnail": "http://books.google.com/books/content?id=9FbwVe577xwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Introduction to Optimum Design",
    "description": "Optimization is a mathematical tool developed in the early 1960's used to find the most efficient and feasible solutions to an engineering problem. It can be used to find ideal shapes and physical configurations, ideal structural designs, maximum energy efficiency, and many other desired goals of engineering. This book is intended for use in a first course on engineering design and optimization. Material for the text has evolved over a period of several years and is based on classroom presentations for an undergraduate core course on the principles of design. Virtually any problem for which certain parameters need to be determined to satisfy constraints can be formulated as a design optimization problem. The concepts and methods described in the text are quite general and applicable to all such formulations. Inasmuch, the range of application of the optimum design methodology is almost limitless, constrained only by the imagination and ingenuity of the user. The book describes the basic concepts and techniques with only a few simple applications. Once they are clearly understood, they can be applied to many other advanced applications that are discussed in the text. * Allows engineers involved in the design process to adapt optimum design concepts in their work using the material in the text. * Basic concepts of optimality conditions and numerical methods are described with simple examples, making the material high teachable and learnable. * Classroom-tested for many years to attain optimum pedagogical effectiveness.",
    "authors": [
      {
        "slug": "jasbir-arora",
        "name": "Jasbir Arora"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "professional-design-patterns-in-vb-net",
    "thumbnail": "http://books.google.com/books/content?id=WZ4MbctzpW8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Professional Design Patterns in VB .NET",
    "description": "* Explains through case studies how design patterns can improve the design of the individual tiers in an application. * Shows how design patterns can be used in conjunction with .NET Remoting across the tiers in an application. * The emphasis throughout is on how design patterns can be used in real applications to write more robust and flexible code.",
    "authors": [
      {
        "slug": "chaur-wu",
        "name": "Chaur Wu"
      },
      {
        "slug": "tom-fischer",
        "name": "Tom Fischer"
      },
      {
        "slug": "peter-stromquist",
        "name": "Peter Stromquist"
      },
      {
        "slug": "john-slater",
        "name": "John Slater"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "introduction-to-java-and-software-design",
    "thumbnail": "http://books.google.com/books/content?id=OQGNOrzDKhQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Introduction to Java and Software Design",
    "description": "Introduction to Java and Software Design breaks the current paradigms for teaching Java and object-oriented programming in a first-year programming course. The Dale author team has developed a unique way of teaching object-oriented programming. They foster sound object-oriented design by teaching students how to brainstorm, use filtering scenarios, CRC cards, and responsiblity algorithms. The authors also present functional design as a way of writing algorithms for the class responsibilities that are assigned in the object-oriented design. Click here for downloadable student files This book has been developed from the ground up to be a Java text, rather than a Java translation of prior works. The text uses real Java I/O classes and treats event handling as a fundamental control structure that is introduced right from the beginning. The authors carefully guide the student through the process of declaring a reference variable, instantiating an object and assigning it to the variable. Students will gradually develop a complete and comprehensive understanding of what an object is, how it works, and what constitutes a well-designed class interface.",
    "authors": [
      {
        "slug": "nell-b-dale",
        "name": "Nell B. Dale"
      },
      {
        "slug": "chip-weems",
        "name": "Chip Weems"
      },
      {
        "slug": "mark-r-headington",
        "name": "Mark R. Headington"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "universal-design",
    "thumbnail": "http://books.google.com/books/content?id=YKP_v1eqsBMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Universal Design",
    "description": "",
    "authors": [
      {
        "slug": "burns-and-roe",
        "name": "Burns and Roe"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "analysis-design-and-evaluation-of-man-machine-systems-1992",
    "thumbnail": "http://books.google.com/books/content?id=jZfOBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Analysis, Design and Evaluation of Man-Machine Systems 1992",
    "description": "Containing 4 plenary papers and 38 technical papers, this volume contributes to the literature on the important subject of man-machine systems. The many topics discussed include human performance skills, knowledge engineering and expert systems, training procedures, human performance and mental load models, and human-machine interfaces.",
    "authors": [
      {
        "slug": "hg-stassen",
        "name": "H.G. Stassen"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "gui-based-design-and-development-for-clientserver-applications",
    "thumbnail": "http://books.google.com/books/content?id=V9NQAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "GUI-based design and development for client/server applications",
    "description": "A nuts-and-bolts guide to building sophisticated client/server GUI applications using state-of-the-art 4GL Workbenches... GUI-Based Design and Development for Client/Server Applications If you're a software developer or mainframe applications programmer who works in the corporate environment and you'd like to update your skills and enhance your marketability, you've come to the right place. With the expert, step-by-step guidance this book offers, taking the big leap from character-based mainframe systems to object-oriented GUI technology is just a walk in the park. Using the top 4GL Workbench products on the market to illustrate the development of a large-scale client/server application example, this book gets you quickly on-line with all the knowledge and skills you need to build sophisticated, customized GUIs that run on a wide range of operating systems and most standard PC/LAN hardware platforms. Examples based on PowerBuilder 3.0, Microsoft Visual Basic 3.0, SQLWindows, and Digitalk Parts Workbench Guides you past common errors and offers practical solutions to most problems that occur during the development cycle Step-by-step guidance for rapid design, development, and deployment of sophisticated customized applications",
    "authors": [
      {
        "slug": "jonathan-sayles",
        "name": "Jonathan Sayles"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "professional-java-ee-design-patterns",
    "thumbnail": "http://books.google.com/books/content?id=W7_lBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Professional Java EE Design Patterns",
    "description": "Master Java EE design pattern implementation to improve your design skills and your application’s architecture Professional Java EE Design Patterns is the perfect companion for anyone who wants to work more effectively with Java EE, and the only resource that covers both the theory and application of design patterns in solving real-world problems. The authors guide readers through both the fundamental and advanced features of Java EE 7, presenting patterns throughout, and demonstrating how they are used in day-to-day problem solving. As the most popular programming language in community-driven enterprise software, Java EE provides an API and runtime environment that is a superset of Java SE. Written for the junior and experienced Java EE developer seeking to improve design quality and effectiveness, the book covers areas including: Implementation and problem-solving with design patterns Connection between existing Java SE design patterns and new Java EE concepts Harnessing the power of Java EE in design patterns Individually-based focus that fully explores each pattern Colorful war-stories showing how patterns were used in the field to solve real-life problems Unlike most Java EE books that simply offer descriptions or recipes, this book drives home the implementation of the pattern to real problems to ensure that the reader learns how the patterns should be used and to be aware of their pitfalls. For the programmer looking for a comprehensive guide that is actually useful in the everyday workflow, Professional Java EE Design Patterns is the definitive resource on the market.",
    "authors": [
      {
        "slug": "murat-yener",
        "name": "Murat Yener"
      },
      {
        "slug": "alex-theedom",
        "name": "Alex Theedom"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "the-principles-and-processes-of-interactive-design",
    "thumbnail": "http://books.google.com/books/content?id=4zQeAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "The Principles and Processes of Interactive Design",
    "description": "A snapshot of the essential areas of digital design, introducing students to best practices for creating within this medium and packed with practical exercises.",
    "authors": [
      {
        "slug": "jamie-steane",
        "name": "Jamie Steane"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "solving-problems-with-design-thinking",
    "thumbnail": "http://books.google.com/books/content?id=sa0zAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Solving Problems with Design Thinking",
    "description": "Design-oriented firms such as Apple and IDEO have demonstrated how design thinking can directly affect business results. Yet most managers lack a real sense of how to put this new approach to use for issues other than product development and sales growth. Solving Problems with Design Thinking details ten real-world examples of managers who successfully applied design methods at 3M, Toyota, IBM, Intuit, and SAP; entrepreneurial start-ups such as MeYou Health; and government and social sector organizations including the City of Dublin and Denmark's The Good Kitchen. Using design skills such as ethnography, visualization, storytelling, and experimentation, these managers produced innovative solutions to problems concerning strategy implementation, sales force support, internal process redesign, feeding the elderly, engaging citizens, and the trade show experience. Here they elaborate on the challenges they faced and the processes and tools they used, offering their personal perspectives and providing a clear path to implementation based on the principles and practices laid out in Jeanne Liedtka and Tim Ogilvie's Designing for Growth: A Design Thinking Tool Kit for Managers.",
    "authors": [
      {
        "slug": "jeanne-liedtka",
        "name": "Jeanne Liedtka"
      },
      {
        "slug": "andrew-king",
        "name": "Andrew King"
      },
      {
        "slug": "kevin-bennett",
        "name": "Kevin Bennett"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "unreal-development-kit-game-design-cookbook",
    "thumbnail": "http://books.google.com/books/content?id=ui5m7AlIbZIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Unreal Development Kit Game Design Cookbook",
    "description": "Written in cookbook style, this book offers many recipes to learn game design with UDK. Each recipe contains step-by-step instructions followed by analysis of what was done in each task and other useful information. The book is designed so that you can read it chapter by chapter, or you can look at the list of recipes and refer to them in no particular order. This book is meant for game artists who are getting used to UDK but may feel the need for guidance on matters of implementation. It also targets brave beginners who are struggling to find an all in one package for getting started with UDK, and want a ready to hand reference. Level designers can use this book to gauge their understanding of the editor, check for specific problems, and discover gems they may not have come across before.",
    "authors": [
      {
        "slug": "thomas-mooney",
        "name": "Thomas Mooney"
      }
    ],
    "categories": [
      "design",
      "ui"
    ]
  },
  {
    "slug": "photoshop-masking-compositing",
    "thumbnail": "http://books.google.com/books/content?id=B64U3TuzVpUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Photoshop Masking & Compositing",
    "description": "Designers, photographers, and artists use Photoshop to create fantastic and realistic images for illustrations, fine art, and editorial content. Whether they're landscape or portrait photographers, illustrators or fine artists, masking and compositing are essential skills to master for combining images to the extent that it is impossible to tell where one image stops and the other one begins. In this completely revised edition of her best-selling guide to masking and compositing, Photoshop artist and educator Katrin Eismann--along with compositing experts Sean Duggan and James Porto--takes readers through numerous step-by-step examples, highlighting the tools and techniques used for masking and combining images. Featuring work by leading artists and photographers, this book focuses on the techniques used to create compelling compositions, including making fast and accurate selections, mastering Photoshop's masking tools, and implementing the concept and photography from start to finish. The book addresses working with Photoshop's selection tools; selecting and maintaining fine details and edges; and working with difficult image elements, such as cloth, hair, or translucent objects. All-new photographic examples, updated instruction to cover the latest version of Adobe Photoshop, and an expanded section on shooting photographs for composite work make this a must-have guide for anyone interested in photographing and creating professional composite images. Visit www.peachpit.com/pmc2e to download dozens of the images featured in this book and practice the illustrated techniques with the same files used in the book. Also, download a full, free chapter on how to use the Pen Tool, one of the best selection tools in Photoshop.",
    "authors": [
      {
        "slug": "katrin-eismann",
        "name": "Katrin Eismann"
      },
      {
        "slug": "sean-duggan",
        "name": "Sean Duggan"
      },
      {
        "slug": "james-porto",
        "name": "James Porto"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "photoshop-cs5-restoration-and-retouching-for-digital-photographers-only",
    "thumbnail": "http://books.google.com/books/content?id=RokrrH0LTkcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Photoshop CS5 Restoration and Retouching For Digital Photographers Only",
    "description": "Adobe Photoshop CS5 Restoration and Retouching For Digital Photographers Only is the complete guide to restoration and retouching. Whether you’re new to Photoshop, or if you’ve been using it for years, you’ll learn lots of new tricks that will help put the beauty back into cherished family photos, and turn new photos into frameable works of art. Follow Adobe Certified Photoshop Expert Mark Fitzgerald as he guides you through the restoration and retouching workflows. Begin by learning about basic concepts, such as proper tonal and color adjustment, selections, and masking. Then learn to master Photoshop’s retouching tools, like the Healing Brush, Patch Tool, and Clone Stamp. After you build a solid foundation, you’ll see how these tools and techniques come together to solve a wide range of restoration and retouching problems; from repairing a damaged print to removing braces and repairing glass glares. Explore the tools and techniques with step-by-step expert instructions for downloadable practice files. Experience the total workflow as you complete three projects along side Mark from start to finish: a restoration project, a portrait retouching project, and an architectural retouching project. This book is an update to Mark Fitzgerald’s popular book, Adobe Photoshop CS3 Restoration and Retouching Bible.",
    "authors": [
      {
        "slug": "mark-fitzgerald",
        "name": "Mark Fitzgerald"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "scott-kelbys-7-point-system-for-adobe-photoshop-cs3",
    "thumbnail": "http://books.google.com/books/content?id=ZZvhhggWvfgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Scott Kelby's 7-Point System for Adobe Photoshop CS3",
    "description": "Scott Kelby, the world's #1 bestselling Photoshop author, and the man who changed the Photoshop and digital photography world with his ground-breaking, award-winning \"Photoshop Book for Digital Photographers\" unveils a exciting, brand new way of thinking, and working in Adobe Photoshop that will not only change the industry again, but it will change the way we all work in Photoshop forever, so we can finally spend less time fixing our images, and more time finishing them. You're about to become a Photoshop Shark! Scott has focused in and really narrowed things down to just exactly which Photoshop tools and techniques we absolutely, positively have to know, and he found that there are just seven major tools, seven major features that we have to master to enhance our images like a pro. But then he took it a step further. Out of those seven major tools, he looked at which parts or sections of those tools do we really need to master, and which parts can we pretty much ignore (in other words, he whittled it down so you're not learning parts of the tools that you're probably never going to need). Then, and perhaps most importantly, he determined exactly when and in which order to apply these seven techniques that make up Scott's amazing \"Photoshop Seven Point System.\" But the magic of this book, is not just listing the seven tools and showing how they work. It's how they're used together, and how Scott teaches them (and makes it stick), that makes this book so unique. You're not going to just learn one technique for fixing shadows, and another technique for adjusting color (every Photoshop book pretty much does that, right?). Instead, you're going start off at square one, from scratch, as each chapter is just one photo—one project—one challenging lifeless image (you'll follow along using his the same images), and you're going to unleash these seven tools, in a very specific way, and you're going to do it again, and again, and again, in order on different photos, in different situations, until they are absolutely second nature. You're finally going to do the FULL fix—from beginning to end—with nothing left out, and once you learn these seven very specific techniques, and apply them in order, there won't be a an image that appears on your screen that you won't be able to enhance, fix, edit, and finish yourself! Plus, Scott's techniques work across a wide range of photos, and that's exactly what you'll be working on in the book, from landscapes to portraits, to architectural, to nature, from event photography to everything in between—there isn't a photo you won't be able to beat! This is the book you've been waiting for, the industry's been waiting for, and Scott's \"Adobe Photoshop Seven Point System\" is so revolutionary that he's officially applied for a patent with the U.S. Patent and Trademark Office, and this new system is only found in this amazing, ground breaking new book. Once you learn these techniques, and start applying them yourself, you'll be the next one to say—\"You can't beat 'The System!'",
    "authors": [
      {
        "slug": "scott-kelby",
        "name": "Scott Kelby"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "adobe-photoshop-50-certification-guide",
    "thumbnail": "http://books.google.com/books/content?id=ivobrawhuEEC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Adobe Photoshop 5.0 Certification Guide",
    "description": "A step-by-step study program prepares Photoshop users for the Adobe Certification Exam (ACE)--the most valued yardstick available to employers seeking to verify skills--and includes sample tests on CD. Original. (Intermediate).",
    "authors": [
      {
        "slug": "michael-lennox",
        "name": "Michael Lennox"
      },
      {
        "slug": "elizabeth-bulger",
        "name": "Elizabeth Bulger"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "professional-photoshop",
    "thumbnail": "http://books.google.com/books/content?id=r8BFmKYZlIQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Professional Photoshop",
    "description": "The commonsense, by-the-numbers approach of Professional Photoshop has shaped the workflows of a generation of Photoshop experts. This new edition, the first in nearly five years, is completely updated for the age of digital photography. It continues the book’s tradition of introducing astoundingly effective, previously unknown methods of image enhancement. The original photographs found in the book come from a variety of professional sources, and all correction exercises are on the included CD. Professional Photoshop has changed radically from edition to edition, and this time is no exception—with almost 90 percent new content and completely overhauled coverage of curves, channel blending, and sharpening.Professional Photoshop offers a full explanation of: How curves bring out detail in the most important areas of the imagen A comprehensive strategy for blending channels to create deeper, stronger images The strengths and weaknesses of CMYK, LAB, and RGB, and when to use each one The first detailed look at the Shadow/Highlight command—and even more sophis-ticated ways to enhance contrast in the lightest and darkest parts of the imagen Sharpening strategies, in three full chapters, including the innovative hiraloam method (High Radius, Low Amount). Plus, a fiendishly effective method of merging hiraloam and conventional unsharp masking The realities—and the politics—of preparing files for commercial offset printing and how to deal with colors that are out of the press’s gamut What Camera Raw and similar acquisition modules can offer Typical problems of digital captures that were not found in the age of film— and how to correct for them",
    "authors": [
      {
        "slug": "dan-margulis",
        "name": "Dan Margulis"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "adobe-photoshop-55-fundamentals-with-imageready-2",
    "thumbnail": "http://books.google.com/books/content?id=sN-SNd5xvHEC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Adobe Photoshop 5.5 Fundamentals with ImageReady 2",
    "description": "A guide for professional users showcases the latest version of Photoshop while covering design fundamentals, project managment, and the demands of the creative process",
    "authors": [
      {
        "slug": "gary-david-bouton",
        "name": "Gary David Bouton"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "adobe-photoshop-55",
    "thumbnail": "http://books.google.com/books/content?id=w4YQAAG7R54C&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Adobe PhotoShop 5.5",
    "description": "Coverage includes applying color techniques and adding type to an image; using layers, channels, and paths; creating special effects with filters; and making images ready for the Web with ImageReady 2.0. A helpful appendix covers using settings and preferences to maximize Photoshop performance.",
    "authors": [
      {
        "slug": "elizabeth-eisner-reding",
        "name": "Elizabeth Eisner Reding"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "digital-painting-in-photoshop",
    "thumbnail": "http://books.google.com/books/content?id=_xKBK6-ncH0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Digital Painting in Photoshop",
    "description": "Have you ever considered using Photoshop to create fine art? Photoshop is usually used for enhancing photos, but this extremely powerful software package is capable of so much more. Every feature, from brushes to background, can be customised and optimised for artistic effect. With a little guidance from a pro, your photoshop results can go from competent retouching of images to visually stunning re-interpretations of them, turning everyday pictures into breathtaking works of art. In this beautiful and inspiring book, acclaimed artist, author and lecturer Susan Bloom shows you how to do just that. Starting with the fundamentals: creating your own artistic brushes and textured papers virtually, she goes on to demonstrate how to create a variety of classic artistic styles in Photoshop, with chapters on watercolours, pastels, charcoal and oil. Further chapters cover illustration techniques in photoshop, and using third-party software to create painterly effects. While the results are highly polished and realistic, this is not a book written specifically for artists. The techniques are aimed squarely at the Photoshop user looking to broaden their pallette, with emphasis on altering photographs to create artwork, rather than creating artwork from scratch. Beautifully written, clearly laid out, and guaranteeing inspiring results, this book is a must-have for every Photoshop user. * Guide to using Photoshop to create fine art from photographs, covering many different artistic styles * Highly visual, inspiring content with clear step-by-step instructions and hundreds of screenshots * Backwards compatible approach: author has taken care to ensure that this fully up-to-date title also applies to previous editions of Photoshop",
    "authors": [
      {
        "slug": "susan-ruddick-bloom",
        "name": "Susan Ruddick Bloom"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "scientific-imaging-with-photoshop",
    "thumbnail": "http://books.google.com/books/content?id=T8l-SVgI0NMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Scientific Imaging with Photoshop",
    "description": "Adobe Photoshop is one of the more powerful tools available to scientists today. It is indispensable in the preparation of digital images of specimens for measurement, especially for separating relevant features from background detail. Scientific Imaging with Photoshop is the authoritative guide to the use of Photoshop in scientific research, with a special emphasis on the ethical ramifications of the use of image-enhancement software to extract data from digital images. Beginning Photoshop users will benefit from its tutorials in the basics of image processing, and more sophisticated users will appreciate the sections on automating Photoshop operations with actions. In addition, the book lays out procedures in straightforward language for acquiring digital images as well as outputting processed images in digital and hard-copy formats. Scientific Imaging with Photoshop provides all this and more: • Little-known methods separating features of interest from the background for subsequent quantification • How to make dense colors and subtle visual detail reproduce properly in publication • Correct Photoshop methods and techniques for all user levels • Procedures that are usable in legacy versions of Photoshop as well as Photoshop Elements and Photoshop Extended",
    "authors": [
      {
        "slug": "jerry-sedgewick",
        "name": "Jerry Sedgewick"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "photoshop-cs3-for-forensics-professionals",
    "thumbnail": "http://books.google.com/books/content?id=TXuVRkynJbUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Photoshop CS3 for Forensics Professionals",
    "description": "",
    "authors": [
      {
        "slug": "george-reis",
        "name": "George Reis"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "real-world-image-sharpening-with-adobe-photoshop-camera-raw-and-lightroom",
    "thumbnail": "http://books.google.com/books/content?id=cCdoL4w_Dr4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Real World Image Sharpening with Adobe Photoshop, Camera Raw, and Lightroom",
    "description": "Just about every digital image requires sharpening since softness is inevitably introduced during the image digitizing process, and oftentimes with digital photography, images are sharpened badly. This second edition of the definitive book by the late Bruce Fraser teaches readers all they need to know about sharpening, including when to use it, why it's needed, how to use the camera's features, how to recognize an image that needs sharpening, how much to use, what's bad sharpening, and how to fix oversharpening. Real World Image Sharpening with Adobe Photoshop, Camera Raw, and Lightroom, Second Edition is written by Fraser's friend and renowned photographer Jeff Schewe. It adds essential coverage of Adobe Photoshop Lightroom and Adobe Camera Raw, since many of the key sharpening functions have migrated from Photoshop to those tools since the first edition of the book was published. The book shows readers how to: recognize the kind of sharpening that each image needs; become acquainted with the full arsenal of sharpening tools built into Photoshop, Lightroom, and Camera Raw; sharpen part of an image selectively; create a complete sharpening workflow that allows sharpening images optimally for different uses; balance the contradictory demands of sharpening and noise reduction; and more.",
    "authors": [
      {
        "slug": "bruce-fraser",
        "name": "Bruce Fraser"
      },
      {
        "slug": "jeff-schewe",
        "name": "Jeff Schewe"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "professional-portrait-retouching-techniques-for-photographers-using-photoshop",
    "thumbnail": "http://books.google.com/books/content?id=XAHd07iGIVcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Professional Portrait Retouching Techniques for Photographers Using Photoshop",
    "description": "Each year, Scott Kelby, Editor-in-Chief of Photoshop User magazine and the #1 best-selling Photoshop author, trains literally thousands of photographers on how to retouch portraits using Photoshop through his live seminars, online classes, DVDs, and standing-room only workshops at the Photoshop World Conference & Expo. Now you can learn the same techniques he uses in his own retouching workflow, in the only book of its kind–one written expressly for photographers who do their own retouching. As a pro photographer himself, Scott understands that photographers make their living shooting, not retouching. But, delivering fully retouched images is now expected by clients. That’s why Scott put together this amazing resource for teaching photographers the quickest, easiest, and most effective ways to create professional-looking, retouched final images without spending hours grinding away at painstaking, detailed techniques. LEARN HOW THE PROS DO IT It’s all here–the step-by-step methods for fixing, enhancing, and finishing your portraits in Photoshop. Using the techniques in this book, you’ll create images that will absolutely wow your clients. You’ll learn: • How to soften skin and still retain detail and texture • The best tricks for beautifully enhancing eyes, eyebrows, and eyelashes • How to selectively sharpen portraits without complicated masking • How to create gorgeous-looking lips • How to remove blemishes fast and keep the most detail • The pros’ tricks for body sculpting • How to make your subject’s hair look fabulous • How to give your retouches that natural look that sets them apart • Plus, you get Scott’s complete 5-minute, 15-minute, and 30-minute start-to-finish workflows If you’re ready to learn the “tricks of the trade”–the same ones that today’s leading pro photographers use to retouch, tuck, tighten, and tone their images for that pro-retouched look–you’re holding the book that will do exactly that. It will radically change the way you retouch your portraits from here on out, and give you the best-looking, most natural retouches you’ve ever done.",
    "authors": [
      {
        "slug": "scott-kelby",
        "name": "Scott Kelby"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "adobe-photoshop-cs2",
    "thumbnail": "http://books.google.com/books/content?id=yEXLXS3An08C&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Adobe Photoshop CS2",
    "description": "Presents a comprehensive visual resource that introduces the diverse components of the popular photo editing software, offering step-by-step instruction in everything from basic photo editing to graphic and Web design to video, with tips on such new features as Adobe Bridge, Smart Objects, Image Warping, UI Customization, and more. Original. (Beginner)",
    "authors": [
      {
        "slug": "david-rivers",
        "name": "David Rivers"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "adobe-photoshop-cs-in-10-simple-steps-or-less",
    "thumbnail": "http://books.google.com/books/content?id=errC3dsxHEwC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Adobe Photoshop Cs in 10 Simple Steps Or Less",
    "description": "Provides step-by-step instructions for over 250 Photoshop tasks, with solutions in ten steps or less, covering such topics as color, selections, channels and masks, layers, type, filters, and automations.",
    "authors": [
      {
        "slug": "micah-laaker",
        "name": "Micah Laaker"
      },
      {
        "slug": "christopher-schmitt",
        "name": "Christopher Schmitt"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "adober-photoshopr-6",
    "thumbnail": "http://books.google.com/books/content?id=Y4ZlxcfIrQIC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Adobe(R) Photoshop(R) 6",
    "description": "Ideal for courses that includes graphic arts and computer design software as part of the curriculum, this book is for courses in Graphic Multimedia or Web Design Software. The resource CD-ROMs contain files needed to create the projects in the text. Instructor CD-ROMs include assessments, overhead presentation materials, and additional projects.",
    "authors": [],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "photoshop-for-right-brainers",
    "thumbnail": "http://books.google.com/books/content?id=sa_ePuR_mX8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Photoshop for Right-Brainers",
    "description": "Attention Right-Brainers! You're an artistic visionary, right? In your head you imagine clever image fixes, fanciful photo manipulations, and artworks of startling genius. But when it comes to bringing these visions to life on your computer—well, that's the hard part. If this sounds familiar, then Photoshop wiz Al Ward's innovative and personal guide to the art of photo manipulation might just be the key to making your dreams come true. Photoshop for Right-Brainers doesn't hamstring you with follow-the-leader, cookie-cutter techniques. Instead, the book explores the artistic creation process, demonstrating how Photoshop can open pathways for originality and keep you from getting stuck creatively. You'll start off doing real-world Photoshop work to get a firm grounding in the essential tools and techniques. Then you'll work through complex projects, honing your skills and learning how to translate even your wildest visions into reality. By the end you'll be able to generate mind-blowing photographic art of your own. Inside you'll learn how to: Expertly blend multiple photographs into composites that are incredibly real Add sharpness and detail to any image Retouch a portrait like a pro: soften wrinkles, erase blemishes, whiten teeth, and more Create mind-boggling mirror effects Control reflections and highlights as you manipulate reflective surfaces like chrome and glass Turn any photograph into a line drawing or an oil painting Map patterns onto contoured surfaces for greater realism Subtly adjust colors to make them more vivid -- or replace them completely Prepare your artwork for display online or in printed contact sheets and picture packages And much more! Note: CD-ROM/DVD and other supplementary materials are not included as part of eBook file.",
    "authors": [
      {
        "slug": "al-ward",
        "name": "Al Ward"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "responsive-web-design-with-adobe-photoshop",
    "thumbnail": "http://books.google.com/books/content?id=xeMnBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Responsive Web Design with Adobe Photoshop",
    "description": "For a couple of decades now, designers have used Photoshop to mock up Web page designs. However, that work generally results in a static graphic of the page, which has to be translated by a developer into the components of a Web page: HTML files and Web-compatible image files. Our multi-device world has shown us that this approach to web design, including full-page comps done in Photoshop, is increasingly problematic. Modern web designers are adopting a new approach: creating flexible web pages whose layout can adapt to suit the screen on which they are displayed. This is “Responsive Web Design” [RWD]. Until now, books on designing responsive Web sites have focused on HTML and CSS – in other words, they've been very code-centric, and visual creativity seems to take a back seat. This new book is aimed at the visual Web designer who’s accustomed to working in Photoshop. Adobe Photoshop CC contains many new features that help streamline the process of converting a static page design to a set of components for a responsive web page. Dan Rose is one of the best-known advocates of this new way of working in Photoshop. He’s observed that only a few people are talking about Photoshop for RWD constructively, yet a majority (63% as of his last informal poll) of web designers are using Photoshop for more than simple asset creation. This transition is a pain point for many designers. His new book will balance coverage of conceptual issues (how to fit tools like Photoshop to the design workflow rather than fitting a workflow to the tools) with practical design exercises tailored to help communicate the overall design direction of the page while respecting the needs of the fluid Web. In addition, he will introduce methods for taking HTML back into Photoshop for further refinement.",
    "authors": [
      {
        "slug": "dan-rose",
        "name": "Dan Rose"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "photoshop-for-interior-designers",
    "thumbnail": "http://books.google.com/books/content?id=4yQiAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Photoshop® for Interior Designers",
    "description": "Provides step-by-step demonstrations that integrate Adobe Photoshop, AutoCAD, Google Sketchup, freehand drawings and Adobe InDesign to create visual presentations.",
    "authors": [
      {
        "slug": "suining-ding",
        "name": "Suining Ding"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "adobe-photoshop-by-design",
    "thumbnail": "http://books.google.com/books/content?id=ZKDgAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Adobe Photoshop by Design",
    "description": "Demonstrates how to use the computer graphics program to enhance photographs, alter images, and manipulate graphic files",
    "authors": [
      {
        "slug": "yuichi-inomata",
        "name": "Yuichi Inomata"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "adobe-photoshop-cs",
    "thumbnail": "http://books.google.com/books/content?id=nfUp0rQwWxcC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Adobe Photoshop CS.",
    "description": "Showcases the computer graphics program's updated features while demonstrating fundamental and advanced Photoshop concepts and displaying professionally designed projects.",
    "authors": [
      {
        "slug": "adobe-creative-team",
        "name": "Adobe Creative Team"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "how-to-cheat-in-photoshop-cs6",
    "thumbnail": "http://books.google.com/books/content?id=s64kr7NVuRYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "How to Cheat in Photoshop CS6",
    "description": "\"Included DVD for Mac & PC with over 5 hours of video tutorials\"--Cover.",
    "authors": [
      {
        "slug": "steve-caplin",
        "name": "Steve Caplin"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "photoshop-for-games",
    "thumbnail": "http://books.google.com/books/content?id=j59OBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Photoshop for Games",
    "description": "Most game artists use Photoshop to work out idea as much as to create a final product that can be used in a game. There are many ways to work efficiently in the program that can be tapped for a workflow that keeps artists productive and sane. This book takes an approach to creating assets in Photoshop that both beginners and intermediates will find refreshing. Where other books focus on Photoshop lessons or on the basics of drawing, Photoshop for Games gives you many hands-on lessons for developing artwork that can be adapted for many purposes. Full of inspiring projects , readers will find examples from comic, realistic, graphic styles, and more. Downloadable project files and videos accompany some of the tutorials so that readers can dive deeper on topics. Whether they are developing games for consoles, mobile devices, or the Web, game artists from all backgrounds will learn the best practices to game art creation in Photoshop.",
    "authors": [
      {
        "slug": "shawn-nelson",
        "name": "Shawn Nelson"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "adobe-photoshop-60-web-design-with-imageready-3-and-golive-5",
    "thumbnail": "http://books.google.com/books/content?id=gboQAQAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Adobe Photoshop 6.0 Web design with ImageReady 3 and GoLive 5",
    "description": "Adobe Photoshop is the industry standard when it comes to Web design--and even more so today, now that Photoshop is integrated with Web productivity tool ImageReady. Many Web designers create their work in Photoshop, prepare it for the Web with ImageReady, and build their Web site with GoLive. With these tools, designers can easily create innovative, energetic, and dynamic Web sites. In this lavishly illustrated four-color book, Web designer Michael Baumgardt shows readers the fastest and most efficient way to go from a Photoshop design to a finished Web site. The book covers the ins and outs of using Photoshop, ImageReady, and GoLive, giving readers a strong foundation in Adobe's suite of Web tools, discussing all the new features of Photoshop 6.0 and GoLive 5.0. Included are basic concepts such as organizational and navigational techniques, as well as explanations of each application's unique strengths and how to best apply them to Web design.",
    "authors": [
      {
        "slug": "michael-baumgardt",
        "name": "Michael Baumgardt"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "the-graphic-designers-digital-toolkit-a-project-based-introduction-to-adobe-photoshop-creative-cloud-illustrator-creative-cloud-indesign-creative-cloud",
    "thumbnail": "http://books.google.com/books/content?id=6jUeCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "The Graphic Designer’s Digital Toolkit: A Project-Based Introduction to Adobe Photoshop Creative Cloud, Illustrator Creative Cloud & InDesign Creative Cloud",
    "description": "THE GRAPHIC DESIGNER’S DIGITAL TOOLKIT, 7th Edition not only introduces students to the essential features of industry-standard software applications, but also gives them an understanding of how to integrate these programs into a seamless whole. Using a highly visual and project-based approach, this fully revised new edition examines Macintosh OS X Maverick, Windows 7 and Windows 8 operating systems, as well the most up to date Creative Cloud features of the “Big 3” digital design programs used in the graphics industry today: Adobe Illustrator, Adobe Photoshop, and Adobe InDesign . After thoroughly examining the features of each application from the designer’s perspective, the author then reveals in practical detail the traditional skills and technology necessary for effective design for print and Web media. Using online project files, students are encouraged to practice what they have learned by tackling design projects throughout the text from concept to completion. Effectively merging theory with practice, THE GRAPHIC DESIGNER’S DIGITAL TOOLKIT, 7th Edition stresses the critical importance of integration in design while meeting design parameters and client expectations. Contact your Learning Consultant to learn more about how CourseMate can enhance the way you teach and your students learn. Important Notice: Media content referenced within the product description or the product text may not be available in the ebook version.",
    "authors": [
      {
        "slug": "allan-wood",
        "name": "Allan Wood"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "photoshop-lightroom-2-for-dummies",
    "thumbnail": "http://books.google.com/books/content?id=ISFZiBtqErcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Photoshop Lightroom 2 For Dummies",
    "description": "Take your digital photography to the next level by learning how to use Adobe Photoshop Lightroom 2 with Photoshop Lightroom 2 for Dummies! From how to install Lightroom and navigate the Lightroom interface to playing with advanced options like creating slideshows and sharing photos with friends and family, this easy-to-understand guide will walk you through every step. You’ll find out all about the Lightroom modules and their functions while understanding the role of the Lightroom catalog, how to care for it, and work with its functions. You will learn everything about working with digital photographs, from distinguishing among various file formats to managing and importing photos. You’ll find out how to view, find, organize and develop photos in the library and utilize the digital darkroom. You’ll even find out how to work with external editors. After reading this book, you will know how to: Install and get started with Lightroom Recognize the role and function of the Lightroom catalog Manage and save files View, find, organize, and develop photos in the library Unleash your creativity with photo editing options Share and export files to share them with friends and family Create copies, slideshows, and web galleries Complete with lists of ten resources, ten common problems and solutions, and ten favorite tips and tricks, Photoshop Lightroom 2 For Dummies is your one-stop guide to setting up, working with, and making the most of Photoshop Lightroom for all your digital photography needs.",
    "authors": [
      {
        "slug": "rob-sylvan",
        "name": "Rob Sylvan"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "photoshop-cc-the-missing-manual",
    "thumbnail": "http://books.google.com/books/content?id=m35NnTkAsG8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Photoshop CC: The Missing Manual",
    "description": "Photoshop CC is truly amazing, but it can also be overwhelming if you’re just getting started. This book makes learning Photoshop as easy as possible by explaining things in a friendly, conversational style—without technical jargon. After a thorough introduction to the program, you’ll delve deep into Photoshop’s secrets with expert tips and practical editing advice you can use every day. The important stuff you need to know: Learn your way around. Take a tour of Photoshop’s workspace and learn how to customize it. Unlock the magic. Use layers, masks, and Smart Objects to safely edit your images. Perfect your photos. Learn techniques for cropping, color-correcting, retouching, and combining photos. Master color. Drain, change, and add color; create gorgeous black-and-whites, partial-color effects, and duotones. Be artistic. Create illustrations, paintings, and pro-level text; use filters effectively, edit video, and create 3D art. Share your work. Produce great-looking images for print, presentations, and the Web. Work smarter and faster. Automate common chores and install plug-ins for complex tasks.",
    "authors": [
      {
        "slug": "lesa-snider",
        "name": "Lesa Snider"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "adobe-photoshop-elements-2",
    "thumbnail": "http://books.google.com/books/content?id=uhVUAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Adobe Photoshop Elements 2",
    "description": "A guide to the computer graphics program contains more than five hundred time-saving enhancements to use with Photoshop Element.",
    "authors": [
      {
        "slug": "jack-davis",
        "name": "Jack Davis"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "photoshop-for-lightroom-users",
    "thumbnail": "http://books.google.com/books/content?id=vKNdAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Photoshop for Lightroom Users",
    "description": "Anyone who uses Adobe Photoshop Lightroom for image management, editing, and workflow knows it is great software, and it has only gotten better with each new version. But there comes a time in every Lightroom user’s life when they want to do something…and they just can’t do it. While Lightroom covers the vast majority of a photographer’s needs–many say it covers roughly 80% of a professional imaging workflow–it just can’t do everything a shooter needs to put the final touches on a great image. Scott Kelby, the #1 bestselling author of photography books, wrote Photoshop for Lightroom Users exactly for those Lightroom users who have recognized that they need Photoshop for the other 20% of their workflow, which will take their images to the next level. There is already a substantial audience for this book, and of course Adobe’s brand-new offering of a Lightroom and Photoshop Creative Cloud bundle for $9.99/month will certainly help grow this Lightroom-and-Photoshop audience very quickly in the coming months. These users don’t need to know everything about Photoshop. They just need to know the essentials edits, techniques, retouching tutorials, and tweaks that they can’t perform in Lightroom, but which will take their images up a notch. Scott covers everything from compositing to adding text over an image to retouching to creating a book cover to advanced sharpening techniques. With Photoshop for Lightroom Users, readers will learn all they need to know in order to fold Photoshop into their imaging workflow with Lightroom.",
    "authors": [
      {
        "slug": "scott-kelby",
        "name": "Scott Kelby"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "adobe-photoshop-elements-3",
    "thumbnail": "http://books.google.com/books/content?id=9Aoz_0SZrT4C&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Adobe Photoshop Elements 3",
    "description": "PhotoshopWorld DreamTeam instructor, Dave Huss, shows how to use the most popular digital photography techniques with Photoshop Elements 3!",
    "authors": [
      {
        "slug": "david-huss",
        "name": "David Huss"
      }
    ],
    "categories": [
      "photoshop"
    ]
  },
  {
    "slug": "adobe-photoshop-50",
    "thumbnail": "http://books.google.com/books/content?id=u1Bscp1PvGIC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "title": "Adobe Photoshop 5.0",
    "description": "The AGAINST THE CLOCK library consists of nineteen highly consistent and effective modules, engineered specifically to meet the needs of commercial, educational, and individual desktop publishing users, instructing them in the use of the software that impacts their industry.",
    "authors": [],
    "categories": [
      "photoshop"
    ]
  }
]